{
    "posts": [
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988893-Options_for_getting_into_the_city_from_NJ-New_York_City_New_York.html",
            "title": "\\noptions for getting into the city from NJ? ",
            "body": "\\n\\n\\n\\nMy husband and I drive to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103454960\\', \\'\\');}, \\'log_autolink_impression\\');NYC from our home in Maryland a couple of times a year, but we are tired of the hassle of driving and the expense of parking in the city. We were considering taking a DC-NYC bus for our next trip in November, but that adds quite a bit of travel time (to get to the DC pickup location from where we live). So we are now considering driving to someplace in NJ where we can leave our car for a couple of nights and take the train (NJ Transit or PATH) into the city. I know there is a train from Hamilton, which would be easy for us to get to from 95/295, but I don't know if there is overnight parking (or even if it is allowed, if there will be any spaces when we get there Saturday around noon). I was also told that there is a train at Princeton Junction and that we can leave our car at a friend's house, but I don't know if leaving from PJ is as convenient as Hamilton. Another friend suggested we could park overnight at Woodbridge Metropark and get into the city from there but didn't specify whether this is NJ Transit or something else. I'm also wondering if it would make sense to go to Weehawken to get the ferry, but that would probably involve more traffic hassles than going to Hamilton or Princeton Junction. I don't know how driving to Weehawken compares with driving to Woodbridge Metropark.\\n\\n\\n\\nCan anyone who has used one or more of these options give me some feedback on the parking situation and relative ease of getting into NYC from there? Also, do we need to reserve train tickets from any of these places, or can we just buy them at the station when we arrive? Again, we will be arriving at the station probably around noon on Saturday, and we will be taking the train from NYC back to the NJ station Monday (Veterans Day) mid-afternoon.\\n",
            "date": "19 Oct 2019, 5:53 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nYou could try the parking lot at the Journal Square PATH station-\\n\\nhttps:/\\xe2\\x80\\xa6journal-square \\n\\n\\n\\nWhatever you decide, Have Fun!\\n",
                    "date": "19 Oct 2019, 6:58 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nSo you have a place to park for free near (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455534\\', \\'\\');}, \\'log_autolink_impression\\');Princeton Junction? \\n\\nThey're commuter trains so you can get tickets at time of travel. Info: https://www.njtransit.com/\\nEdited: yesterday, 07:13 ",
                    "date": "19 Oct 2019, 7:12 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103456332\\', \\'\\');}, \\'log_autolink_impression\\');Hamilton not only has a huge garage, but it has an outdoor overflow lot. You can park for 2 weeks with no problem or actually longer if you notify them when you arrive. The parking is $12 per day. It is right off Exit 65B of 295. They never run out of space, especially not on a Saturday. Most people park there to go to work in New York City or the nearby suburbs of NYC.\\n\\nhttps://www.njtransit.com/rg/rg_servlet.srv\\xe2\\x80\\xa6\\n\\nThis is better and cheaper than Princeton Junction, and 10 miles closer to Maryland. It costs $17.25 per person, I believe to get to NYC. If older than 62, it's only $7.25 if i remember right. I use the NJ Transit app and buy my ticket online 10 minutes before the train arrives. You have to purchase it then activate it. Or you buy the tickets from a machine at the station. The ride takes 85 minutes to go 65 miles. If you parked in NYC you couldn't do it all that fast. If you parked in Jersey City, the traffic lights would make you miserable there. And weekend parking is at least $12 per day in Jersey City, if you use a parking app.\\n\\nNo, Hamilton is certainly convenient. You can get two tickets on one app. Let the spouse not driving get the two tickets ready to activate when you get to the platform.\\nEdited: yesterday, 09:29 ",
                    "date": "19 Oct 2019, 9:25 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nWhen parking at Metropark, taking the commuter NJ Transit would be much less expensive than Amtrak, which shares the rail lines. Amtrak will cost about $30 each well in advance while NJT is about $12pp. Trip on NJT takes about an hour. \\n\\nParking on the weekend is easy and inexpensive (roughly $10/24 hours). There are 2 huge garages, largely underutilized on the weekend. \\n\\nTickets for NJ Transit are purchased at the station. There are ticket kiosks, and if I remember correctly, a manned ticket booth. \\n\\n\\n\\nhttps://www.njtransit.com/rg/rg_servlet.srv\\xe2\\x80\\xa6\\n\\n\\n\\nhttps://m.njtransit.com/mo/mo_servlet.srv\\xe2\\x80\\xa6\\n",
                    "date": "19 Oct 2019, 9:31 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nLook up (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103456368\\', \\'\\');}, \\'log_autolink_impression\\');OurBus and see that it goes from the Park and Ride Lot on Georgia Avenue near Olney near the ICC (MD-200) in the morning at 7:45 and returns at night leaving NYC at 4:30 and 8 PM, the later one arriving back before Midnight. I didn't believe it until someone told us about it. $20 or $25 each way. Go down Norbeck, turn left on Georgia, and left into the lot just after the eastbound 200 entrance. Free parking; safe neighborhood (since I live right there).\\n",
                    "date": "19 Oct 2019, 9:34 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103456469\\', \\'\\');}, \\'log_autolink_impression\\');Hamilton and Princeton Junction are on the same NJ Transit rail line (the Northeast Corridor line), so the same trains stop at both. The only exception that I know of is that PJ is served by Amtrak a few times per day, but you don't want to use Amtrak for this trip (too expensive and infrequent).\\n\\n\\n\\nHamilton is a few minutes farther from NYC but will require less driving. Parking at PJ is cheaper ($6/day), but there is no garage; you'll have to park in an open lot. Parking at PJ is managed by the West Windsor Parking Authority (the station is located in the town of West Windsor). For information on using their parking lots go to https:/\\xe2\\x80\\xa6Daily-Parking.aspx\\n\\n\\n\\nThe main thing to know is that you must pay for parking in advance at one of several automated kiosks. \\n\\n\\n\\nAt both stations, you can park for up to 14 days. PJ has fewer spaces than Hamilton, but availability won't be a problem if you're arriving on a Saturday. At both stations, you buy train tickets from a NJ Transit vending machine. As someone noted earlier, these are commuter trains that don't take reservations in advance. It is possible to buy your tickets on the train, but you will pay a penalty (I believe it's $5).\\n",
                    "date": "19 Oct 2019, 9:53 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nJust realized that you said you have a free place to park in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103456512\\', \\'\\');}, \\'log_autolink_impression\\');Princeton Junction, so my information about parking at the station is probably unnecessary. \\n\\n\\n\\nI also forgot to mention that your NJ Transit rail tickets will be slightly cheaper if you start at PJ because PJ is one stop closer to NYC than Hamilton (but you'll have to drive a few miles farther).\\n",
                    "date": "19 Oct 2019, 10:03 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nWow, you have all given me great information--I really appreciate it. NorthofDC, the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103463257\\', \\'\\');}, \\'log_autolink_impression\\');OurBus Georgia Ave. stop would be very convenient, but I just checked Trip Advisor reviews and about half of them are terrible. So I would be nervous about trying that. I think driving to Hamilton or Princeton Junction to get the train may be the best idea. We are both over 62 so the tickets will be fairly inexpensive, at least partially offsetting the parking cost if we decide to go to Hamilton. However, it is not that much farther to go to PJ and parking would be free there (at my friend's house). My husband is the driver, so I will let him make the decision.\\n",
                    "date": "19 Oct 2019, 7:03 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nAll good advice here for the question you asked.\\n\\n\\n\\nJust wondering if you also considered BWI rail station and Amtrak?\\n\\n\\n\\nWould be a bit more expensive - but I think faster door to door and on a cleaner/nicer train (IMHO) that has room for luggage.\\n\\n\\n\\nBut, as noted, your original plan will work fine, and will save $s.\\n",
                    "date": "19 Oct 2019, 7:50 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: options for getting into the city from NJ? \\n",
                    "body": "\\n\\n\\n\\nRayR, thanks for that suggestion. Amtrak was the first option we considered, but the tickets were quite expensive--would be worth it if we were staying for several days (which we often do), but on this trip we are only staying 2 nights. We will only have carry-on luggage, so hopefully that will not be a problem on NJ Transit, especially on Saturday going into the city. However, we will probably be leaving the city Monday 3-4 pm, which I assume will be fairly crowded. Do you know if there are overhead racks on the NJ Transit commuter trains? Or are they more like subway trains, without any place for luggage? Of course, even on subway trains a lot of people have bags (for example, to go to the airport).\\n",
                    "date": "19 Oct 2019, 8:09 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988001-What_can_do_I_with_a_6_5_JFK_layover_Enough_for_Manhattan-New_York_City_New_York.html",
            "title": "\\nWhat can do I with a 6.5 JFK layover? Enough for Manhattan? ",
            "body": "\\n\\n\\n\\nMy international arrival (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103447778\\', \\'\\');}, \\'log_autolink_impression\\');flight comes to JFK at 9am. The domestic flight on another airline leaves 330pm. (One flight purchase/batch with with two airlines partnered w/ each other - but implying I need a separate check-in process.) Given the time I need leaving the airport, preparing for the second flight, storing my backpack in a locker if I so choose, etc -- is this enough time to see the city? Or would you guys recommend I just stay at the airport?\\n",
            "date": "18 Oct 2019, 7:24 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\nI think it depends on how long it takes you to get thru immigration and that\\xe2\\x80\\x99s largely dependent on how many other planes arrive at the same time.\\n\\n\\n\\nThere are no lockers at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103447881\\', \\'\\');}, \\'log_autolink_impression\\');JFK but there,s luggage storage in 3 terminals\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nFor ideas for staying closer to the airport, look at the extreme right column on this page, second bullet down.\\n",
                    "date": "18 Oct 2019, 7:33 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\nFigure an hour for immigration/baggage/customs and an hour each way between (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103447922\\', \\'\\');}, \\'log_autolink_impression\\');JFK and the City, another 2 hours you'll need to check-in prior to your domestic flight, leaving (maybe!) 90 minutes in the City. Your call.\\n\\n\\n\\nCH\\n",
                    "date": "18 Oct 2019, 7:36 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\nI'm going to say no. Assuming you land on time it will likely take 1-2 hours to clear customs/immigration. It sounds like you'll need to recheck luggage and go through security again so allow a couple hours for that. \\n\\nIt would take roughly one hour each way to and from Manhattan, just not enough time. \\n\\nI would suggest hanging out at the ultra cool (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103447931\\', \\'\\');}, \\'log_autolink_impression\\');TWA hotel at the airport that has lounges, bars, and restaurants.\\n",
                    "date": "18 Oct 2019, 7:37 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\n^\\n\\n+1 to that.\\n",
                    "date": "18 Oct 2019, 7:43 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\nSorry but I agree that you do not really have enough time to get into the city, do anything worthwhile and get back to the airport in time. Unfortunately there is nothing near (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103448096\\', \\'\\');}, \\'log_autolink_impression\\');JFK that I can think of that is worth going to see either.\\n",
                    "date": "18 Oct 2019, 7:49 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103448364\\', \\'\\');}, \\'log_autolink_impression\\');TWA Hotel? Maybe there isn't that much to see but it's something.\\n",
                    "date": "18 Oct 2019, 8:08 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\n^\\n\\nThe OP can take their time exiting the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103448441\\', \\'\\');}, \\'log_autolink_impression\\');plane/clearing immigration. Then have an expensive breakfast at the hotel, check out the retro lobby/common areas and the TWa store. It really is a cool hotel. \\n\\n\\n\\nThen just hang out in his/her terminal. Time will fly by.\\n",
                    "date": "18 Oct 2019, 8:14 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: What can do I with a 6.5 JFK layover? Enough for Manhattan? \\n",
                    "body": "\\n\\n\\n\\nYou could, if you have time, spend a couple of hours in Forest Hills, see the fancy houses, the extremely pleasant shopping district, I'd say it's the nicest (to me) part of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103448793\\', \\'\\');}, \\'log_autolink_impression\\');NYC to live in. There are good diners on Queens Blvd and many stores on Austin St, 71st Avenue, and Queens Blvd. \\n\\nYou get there by taking the Airtrain to Jamaica, and the E train for 10 minutes to \"71st Avenue-Forest Hills\". You save nearly 2 hours of traveling around and have an especially nice in-NYC place to visit.\\n\\nAlso, if it's one ticket, I doubt that you will have to check your luggage or check in a second time; but you will have to go through security to get back to the gates, of course. You can ask when you check the luggage the first time. If it has your final airport listed on the attached routing card on your luggage, you are set. Of course, you have to get your luggage at Customs at JFK, then they take it back afterwards to put on the next plane. Or at least, that's the normal procedure when it is on one ticket.\\n",
                    "date": "18 Oct 2019, 8:37 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986125-Itinerary_help_2_adults_2_teenagers_early_Nov_for_5_days-New_York_City_New_York.html",
            "title": "\\nItinerary help - 2 adults 2 teenagers early Nov for 5 days ",
            "body": "\\n\\n\\n\\nHi All\\n\\n\\n\\nIve been reading through all the fantastic tips, suggestions and trip reports ahead of our (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103429802\\', \\'\\');}, \\'log_autolink_impression\\');NYC trip in early Nov. We are a family from Ireland, 2 adults, 2 teenagers age 16 and 14. We will be coming from a very relaxing week in Foridas gulf coast so will not be jet lagged when we arrive. Myself and husband have been to NYC many times before but kids have not so we will be doing a lot of the usual tourist stuff. Kids have opted not to do the Met and ANMH but I think I can convince them to look into MoMa. The only thing I have reserved is SOL with crown access on Weds, all other things can be moved about weather dependent. \\n\\n\\n\\nBelow is a rough itinerary that Ive cobbled together to make the most of our time and areas that I believe are geographically close. All suggestions. recommendations welcomed. - Thanks! :)\\n\\n\\n\\n\\n\\nMon 4th \\n\\nArrive Grand Central Terminal (we are coming from Scarsdale as will be visiting friends) hope to look around while there although will have luggage with us? Checkin if possible to hotel just off Times Sq. Walk to Vessel (will book tickets in advance when 2 weeks out), then high line down Chelsea Market. \\n\\nGreenwich/ Washington park? not sure how long all this will take? Go back to Times Sq for night time?\\n\\n\\n\\nTues 5th (think this day could be interchangeable with Thurs)\\n\\nCentral park with hire bikes - maybe ice skating there too? St Pats cathedral, ToTR and maybe ice skating there? I read that free tickets to the 911 museum become available on Tuesdays around 4pm? I'm not sure if the kids would like this or not - will defo visit the memorial pools at some stage. \\n\\n\\n\\nWeds 6th. \\n\\nSOL tour at 11, banking on at least 3/4 hours for this with Ellis island tour too. Maybe we should visit Wall street and 911 after this as we will be down that way?\\n\\n\\n\\nThurs 7th \\n\\nSubway to Brooklyn, look around DUMBO and walk back. no evening plans, maybe MoMa? \\n\\n\\n\\nFri 8th.\\n\\nShopping and other last minute stuff as we need to leave for airport about 4pm. \\n\\n\\n\\nHoping to see a show, possibly Book of Mormon for all of us (if we can get cheap tix) or Mean girls for myself and daughter. Husband and son might like Concorde and Intrepid musuem? \\n\\nWe will be doing some shopping on and off and will be around Macys and Herald Square at some stage. \\n\\n\\n\\nthanks for your input.\\n\\n\\n\\nJJ\\n",
            "date": "17 Oct 2019, 6:35 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nYou have a lot of outdoor activities planned. I would make sure to have \"Plan B's\" in case of rain.\\n\\n\\n\\nI think the kids may be too young for the 9/11 Museum. It is an intense emotional experience for most adults, and for many requires some \"down time\" to walk, meditate, pray, visit a house of worship, etc. I would not plan a fancy meal or expensive outing (play, sports event, etc.) for afterward.\\n\\n\\n\\nYou may have to wait in line for the SOL for about an hour. I would arrive by 10 a.m. If you fully explore Lad Liberty and (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103429918\\', \\'\\');}, \\'log_autolink_impression\\');Ellis Island, you might have \"museum overload\" if you go to 9/11 thereafter.\\n",
                    "date": "17 Oct 2019, 6:44 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nI have to disagree with the advice re the 9/11 Museum. It is actually perfect for teens that age and if you are coming from overseas, by way of FL, it is an important learning/teaching experience that they may not get a chance to visit anytime soon. \\n\\n\\n\\nThe 9/11 Museum is what it is. Absolutely no reason to not take teens because it is intense. Teens need to realize what type of world we lived in then and now.\\n",
                    "date": "17 Oct 2019, 6:53 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nTo avoid confusion, use the term (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103430470\\', \\'\\');}, \\'log_autolink_impression\\');Greenwich Village or the Village for short. Greenwich is a city in Connecticut - close enough to cause confusion.\\n\\nAs for Book of Mormon, there are no cheap tickets to this show, It is not on discount. Mean Girls is on discount. Check Broadway Box, Playbill & TheaterMania for discounts.\\n",
                    "date": "17 Oct 2019, 7:23 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nThanks for all the quick replies,\\n\\nGood idea re having a plan B of weather is bad. And yes I'm on the fence about 911, my son is a history buff and would be keen my daughter I'm not so sure about. Think we might wait and see. thanks for the tip about waiting in line for SOL and The village as opposed the somewhere in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103430836\\', \\'\\');}, \\'log_autolink_impression\\');Connecticut ;)\\n\\n\\n\\nApart from that does the plan look doable? I'm afraid of overloading the days. \\n\\n\\n\\nthanks again\\n\\n\\n\\nJJ\\n",
                    "date": "17 Oct 2019, 7:47 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nHi there, have you thought of the intrepid at all? Is was a massive hit with my 10 year old son (who\\xe2\\x80\\x99s very mature for his age) and now at almost 15 he says that was one of his favourite things in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103431012\\', \\'\\');}, \\'log_autolink_impression\\');NYC and the one he\\xe2\\x80\\x99d do again and again. I thoroughly enjoyed it myself and learnt a whole lot as well as had fun especially squeezing into a submarine. \\n\\nIt maybe an idea if it\\xe2\\x80\\x99s a rainy day. We spent a good half a day there and had dinner in the canteen which was a hit with my son who is keen on history and aviation. \\n\\nOne evening we went bowing in Times Square which was a lot of fun and a big hit with my son as it had photos of many many celebrities bowing there. X\\n",
                    "date": "17 Oct 2019, 8:00 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\n^\\n\\n2 very cool suggestions.\\n",
                    "date": "17 Oct 2019, 8:05 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nBrill, some more great ideas, yes we are considering the Intrepid, kids were on an aircraft carrier in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103431618\\', \\'\\');}, \\'log_autolink_impression\\');San Diego but were very young and were on a submarine in San Francisco too but really liked it. Bowling in Times Sq sounds good too. \\n\\n\\n\\nthanks again!\\n",
                    "date": "17 Oct 2019, 8:40 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nHope you guys have a blast x\\n",
                    "date": "17 Oct 2019, 8:49 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nI highly recommend the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103432694\\', \\'\\');}, \\'log_autolink_impression\\');Tenement Museum in the Lower East Side. It's a museum of immigration to the US, and there are different tours you can take. Maybe you would be particularly interested in one focused on Irish immigrant. I did the Under One Roof tour about 3 families who successively lived in the same tenement and our guide really held my teens' interest.\\n",
                    "date": "17 Oct 2019, 9:46 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Itinerary help - 2 adults 2 teenagers early Nov for 5 days \\n",
                    "body": "\\n\\n\\n\\nIf you are interested in going to the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434350\\', \\'\\');}, \\'log_autolink_impression\\');Tenement Museum, I would purchase the tour tickets ahead of time. They sell out, so you can't just show up and join a tour (speaking from experience here).\\n\\n\\n\\nIf your daughter has doubts about the 9/11 Museum, I would not force her to go. I often say here, I started reading Holocaust survivor stories when I was 12, but I would not have been ready to visit Auschwitz or Bergen-Belsen. There are things there that cannot be unseen, once seen. Every person has a different level of sensitivity from the next. The Museum is built on the footprints of the buildings, the site of a mass murder. Some people must leave (they have many doors in case it's too much). Some people lose their appetite. Again, I would discuss it thoroughly with your kids and it just may be the case that she (and/or he) are not ready. There's enough sadness in the world. If they want to wait, I would allow them.\\n",
                    "date": "17 Oct 2019, 11:43 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986600-Manhatten_Hotels-New_York_City_New_York.html",
            "title": "\\nManhatten Hotels ",
            "body": "\\n\\n\\n\\nHello,\\n\\nI will be attending a conference in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103433939\\', \\'\\');}, \\'log_autolink_impression\\');Lower Manhatten around 435 Hudson for 1 day, the next day we will be at 205 W. 39th St. \\n\\nI don't know my way around NY at all.\\n\\n\\n\\nI wanted to ask if anyone has a recommendation for a reasonably priced hotel in the area. It doesn't have to be fancy, just clean and with a fitness center.\\n\\n\\n\\nThank you for any advice anyone may have.\\nEdited: 17 October 2019, 23:13 ",
            "date": "17 Oct 2019, 11:09 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nIs it just you or will you be sharing a room? What is your preferred nightly budget? Is it just one night? What are your dates? Hotel prices vary from day to day based on what is happening in town. \\n\\n\\n\\nThose 2 addresses are about 2 miles apart. Do you prefer to stay closer to one of those places? \\n\\n\\n\\nHelp the hotel gurus help you by providing some details.\\nEdited: 17 October 2019, 23:17 ",
                    "date": "17 Oct 2019, 11:16 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nExact dates are important, too. A hotel that costs $210 one night can go for $350 another night.\\n\\n\\n\\nThe easiest way to get around (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434165\\', \\'\\');}, \\'log_autolink_impression\\');NYC is via subway. You could stay at a hotel near either of these two places and take a subway to the other; stay in the middle and take the subway to both; or stay near neither, if necessary, and take a subway to both.\\n",
                    "date": "17 Oct 2019, 11:30 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\n205 West 39th St is right at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434549\\', \\'\\');}, \\'log_autolink_impression\\');Times Square. If you want to be in the middle of the most touristy of touristy sections (and many people do) stay anywhere near the southern end of Times Square. The streets (as you can tell) are numbered. How about the Hampton Inn Times Square South? It's right there at your venue. And the downtown (a direction) #1 train goes right to the venue on Hudson St (you get off at the Houston Street Station. To go back to Times Square, you take an Uptown #1 train. \\n\\nWhen someone says they know nothing, I recommend looking at the grid-like map of their neighborhoods: You know how St. Louis has numbered streets and well-organize cross-streets downtown? NYC is similar just better with numbered avenues crossing the numbered streets.\\n\\nHudson Street area: \\xe2\\x80\\xa6mta.info/maps/\\xe2\\x80\\xa6M02_SoHo_TriBeCa_2015.pdf\\n\\n39th St Times Square Area: \\xe2\\x80\\xa6mta.info/maps/\\xe2\\x80\\xa6M11_midtown_2015.pdf\\n",
                    "date": "17 Oct 2019, 11:57 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\n@debbiejj: when you say '435 Hudson' is the number on (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103435002\\', \\'\\');}, \\'log_autolink_impression\\');Hudson Street? If you want to stay near to the venue and travel to West 39th, have a look at the Four Points by Sheraton Soho. The hotel is close to both Houston and Spring Streets subway stations.\\n",
                    "date": "18 Oct 2019, 12:26 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nIf you want a busy Midtown vibe, stay near your 39th St address.\\n\\n\\n\\nIf you want a more quaint, neighbourhood type of vibe, stay near your (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436801\\', \\'\\');}, \\'log_autolink_impression\\');Hudson St address.\\n\\n\\n\\nBudget and dates are needed for specific recommendations.\\n",
                    "date": "18 Oct 2019, 2:38 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nAnother question would be if you intend to stay longer in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436912\\', \\'\\');}, \\'log_autolink_impression\\');NYC to do sightseeing. You may not need to stay near your conference locations at all. The subway can you get you there and you could stay somewhere else to focus on your sightseeing.\\n",
                    "date": "18 Oct 2019, 2:47 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nWe think that the best area for visitors to stay is in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103438816\\', \\'\\');}, \\'log_autolink_impression\\');Greenwich Village....but hey, we've lived here for almost 50 years. That said, we like the Washington Square Hotel just across the street from Washington Square Park in the heart of Greenwich Village (and not far from your conference!) We stay there when family comes to visit NYC and we give them our Village apartment. The area is vibrant with universities and attractions, close to SoHo and Chinatown for shopping, has great restaurants, and easily accessible public transportation.\\n\\n\\n\\nCH\\n",
                    "date": "18 Oct 2019, 6:26 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nThe 2 locations you mention are not close. Do you use google maps? That would be a big help I think.\\n\\nMaps.google.com\\n\\nType the 2 locations and you'll see distance. If you click on the train icon, you'll see public transport options.\\n\\n\\n\\nSince budget usually rules hotel decisions and we don,t know how long you\\xe2\\x80\\x99re staying, your dates, your budget or anything else, it's hard to recommend options.\\n",
                    "date": "18 Oct 2019, 6:48 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nThank you so much. There will me myself and 2 colleagues-so we will need 3 rooms, for 2 nights - check in on 12/2, check out on 12/4. We are flying into (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103439686\\', \\'\\');}, \\'log_autolink_impression\\');LGA. We don\\xe2\\x80\\x99t need luxury or the Ritz, just, clean and modern. Like a Sheraton or Marriott. We\\xe2\\x80\\x99d like to keep it around $250 per nite for each of us, we have to have a fitness center. A restaurant in the hotel would be nice. We don\\xe2\\x80\\x99t have a preference for location, just convenient hopefully. \\n\\nThank you again\\n",
                    "date": "18 Oct 2019, 8:33 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Manhatten Hotels \\n",
                    "body": "\\n\\n\\n\\nThank you so much. The address on (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103439772\\', \\'\\');}, \\'log_autolink_impression\\');Hudson is 435, the other venue is at 205 w39th St\\n\\nI have looked up both locations on the map, just not sure what\\xe2\\x80\\x99s safe or not. Unfortunately the only time we will have for site seeing is in the evening. I am returning with family in January just to see all the sites. \\n\\nThank you again\\n",
                    "date": "18 Oct 2019, 8:46 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12991119-Comedy_club_show_recommendations-New_York_City_New_York.html",
            "title": "\\nComedy club/show recommendations? ",
            "body": "\\n\\n\\n\\nHello\\n\\n\\n\\nIn (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103475540\\', \\'\\');}, \\'log_autolink_impression\\');NYC 11/30- 3/12, been several times before, this time as a last stop after a trip to Toronto/Niagara, so will be over the jet lag. \\n\\n\\n\\nLooking for recommendations for comedy venues to look into. We\\xe2\\x80\\x99re staying in the Sheraton in Brooklyn (by Hoyt) but have family in Tribeca and confident travelling around for a good place. We\\xe2\\x80\\x99re a couple from London in our mid-late thirties, not easily offended so all styles of comedy considered. \\n\\n\\n\\nAny food/bar recommendations near our hotel also well received! \\n\\n\\n\\nThanks in advance.\\n",
            "date": "20 Oct 2019, 1:32 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Comedy club/show recommendations? \\n",
                    "body": "\\n\\n\\n\\nI think the comedy cellar is a sure bet: https://www.comedycellar.com/\\n",
                    "date": "20 Oct 2019, 1:35 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Comedy club/show recommendations? \\n",
                    "body": "\\n\\n\\n\\nEastville on (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476737\\', \\'\\');}, \\'log_autolink_impression\\');Atlantic Ave. \\n\\n\\n\\nRe food, loads of options in the area:\\n\\n-Bedouin tent\\n\\n-Bacchus\\n\\n-bar tabac\\n\\n-sam\\xe2\\x80\\x99s on court street\\n\\n-mile end\\n\\n-Bareburger\\n\\n-Food court at City Point\\n\\n-Hanco\\xe2\\x80\\x99s\\n\\n-Cibao\\n\\n-Junior\\xe2\\x80\\x99s for cheesecake\\nEdited: today, 15:46 ",
                    "date": "20 Oct 2019, 3:46 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Comedy club/show recommendations? \\n",
                    "body": "\\n\\n\\n\\nI like (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476831\\', \\'\\');}, \\'log_autolink_impression\\');Gotham City Comedy club, but there are several that are fun - including Comedy Cellar as recommended by jmctl.\\n\\n\\n\\nI'd take a look at the comedians for the nights you are considering and base your choice more on that than on the venue. All of the clubs will list their acts on their website with breif bios and frequently links to snippets from some of their recent performances.\\n",
                    "date": "20 Oct 2019, 3:58 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Comedy club/show recommendations? \\n",
                    "body": "\\n\\n\\n\\nRayR is right you should look at the line up before making your choice. The line up for (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103477063\\', \\'\\');}, \\'log_autolink_impression\\');Comedy Cellar is published on Thursday for the coming weekend.\\n",
                    "date": "20 Oct 2019, 4:20 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Comedy club/show recommendations? \\n",
                    "body": "\\n\\n\\n\\nThanks all. Definitely agree we would look up the acts before making a decision, just looking for a few decent clubs to narrow down the search. We lean towards smaller, independent comedy clubs rather than big commercial chains when we go for comedy in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103477172\\', \\'\\');}, \\'log_autolink_impression\\');London. Atmosphere is important for comedy!\\n",
                    "date": "20 Oct 2019, 4:29 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986935-Best_location_for_specific_sights_in_NYC-New_York_City_New_York.html",
            "title": "\\nBest location for specific sights in NYC ",
            "body": "\\n\\n\\n\\nHi,\\n\\nI\\xe2\\x80\\x99m looking for suggestions for the best location to stay in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436638\\', \\'\\');}, \\'log_autolink_impression\\');NYC that is close to or has good public transportation to the following. Museum mile, Central Park, China Town and theaters (live). Thanks so much for your help.\\n",
            "date": "18 Oct 2019, 2:24 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nYour attractions are all over Manhattan. If you want recommendations, give us your exact dates of travel, budget including 15% tax & desired bedding configuration & we can help you. The only thing you need as far as location is that your hotel should be near a subway station serving several lines so that you can get around easily.\\n",
                    "date": "18 Oct 2019, 2:28 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nMidtown east in the mid 40s. Walk to theater district and (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436730\\', \\'\\');}, \\'log_autolink_impression\\');Central Park, easy subway or bus uptown to museum mile, east subway to canal st to Chinatown.\\nEdited: 18 October 2019, 02:31 ",
                    "date": "18 Oct 2019, 2:31 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nAll of your sights except for Chinatown are in the uptown part of Manhattan. Chinatown is downtown. You'd need a subway ride to get down there.\\n\\n\\n\\nI would look at hotels in Midtown (including East and West) and maybe even the UWS. From these areas you can access (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436740\\', \\'\\');}, \\'log_autolink_impression\\');Museum Mile, Central Park and the theaters either walking or a short subway/bus ride. Getting down to Chinatown will need a longer subway ride.\\n\\n\\n\\nBlumebwaybaby is right, your dates and budget really determine where you stay. Some hotels are expensive while others are cheap.\\n",
                    "date": "18 Oct 2019, 2:32 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nJan 13-20 th. Would love an old quirky Brownstone Hotel......around $140 a night...thank you\\n",
                    "date": "18 Oct 2019, 2:33 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nAynat62, thanks so much \\xe2\\x9d\\xa4\\xef\\xb8\\x8f\\n",
                    "date": "18 Oct 2019, 2:35 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nMidtown would fit the bill, but in reality, you can pick another neighborhood as well, just use the subway to get around for distances that are too far for walking.\\n",
                    "date": "18 Oct 2019, 2:53 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nIf you chose a hotel about 7th & 8th Ave up near W42nd to W53rd St there's plenty of subway routes to chose from that will transport you throughout Manhattan.\\n",
                    "date": "18 Oct 2019, 3:29 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nEvery single hotel on the island of Manhattan that is NOT west of 10th Avenue is a quick subway ride away from everything you mentioned. Stay in whatever neighborhood you like and any a hotel you like and can afford. It makes no difference. Hard-core touristy tourists stay in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103437519\\', \\'\\');}, \\'log_autolink_impression\\');Times Square. I stay southeast of the Empire State Building in Kips Bay.\\nEdited: 18 October 2019, 03:35 ",
                    "date": "18 Oct 2019, 3:34 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nI agree that Midtown East would have the fastest transit time on average to everything you listed in the OP. \\n\\n\\n\\nBut as others have said, almost anywhere on Manhattan is reachable from almost anywhere else by subway.\\n",
                    "date": "18 Oct 2019, 3:41 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Best location for specific sights in NYC \\n",
                    "body": "\\n\\n\\n\\nAnother question is, how many people and how many beds? Your screenname photo shows a family with 3 children. \\n\\n\\n\\nWill the whole family be travelling?\\n",
                    "date": "18 Oct 2019, 3:45 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12984966-Two_Bedroom_Family_Suites_in_NYC-New_York_City_New_York.html",
            "title": "\\nTwo Bedroom Family Suites in NYC ",
            "body": "\\n\\n\\n\\nHello,\\n\\n\\n\\nI am traveling to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103418188\\', \\'\\');}, \\'log_autolink_impression\\');NYC in April for 10 days with my husband, two young children (ages 1 and 3), and our nanny. We are looking for a two-bedroom suite, preferably on the Upper East Side or Midtown East area (where our family resides), but would consider other options that are in the heart of the city. Any suggestions on hotels? We are looking for places with 3-stars (or better) and would like to keep the cost at under $900/night (hopefully much less). I'm having a hard time finding much within our budget. Any suggestions would be greatly appreciated. Thank you in advance!\\n",
            "date": "17 Oct 2019, 2:46 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\nhttps://www.tripadvisor.co.uk/Hotel_Review-g\\xe2\\x80\\xa6\\n\\n\\n\\nWe're booked here for a few nights in February\\n",
                    "date": "17 Oct 2019, 2:49 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103418245\\', \\'\\');}, \\'log_autolink_impression\\');The Marmara Manhattan on the Upper East Side might be one to look into. Check their rates for your stay dates.\\n\\n\\n\\nhttps://manhattan.marmaranyc.com/2-bedroom/\\n",
                    "date": "17 Oct 2019, 2:51 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103418437\\', \\'\\');}, \\'log_autolink_impression\\');Affinia Gardens on the border of midtown and UES.\\n\\n\\n\\nBeaconhotel.com\\n\\nupper west side.\\n\\n\\n\\nBest Western Hospitality \\n\\nMidtown east\\n",
                    "date": "17 Oct 2019, 3:05 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\nWhat dates in April? If over Easter, that drives up prices and availability.\\n",
                    "date": "17 Oct 2019, 3:06 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\nWe stayed at the \"Best Western Hospitality House\" on East 49th 3 years ago which was adequate for our needs and had the bonus of breakfast included which made it good value as well.\\n\\nOur apartment had 2 bedrooms.one being a twin bedded room and the other had a quite large double bed as well as having a sofa bed in the lounge area.\\n\\nI understand they have other types of rooms available.\\n\\nThere was quite a lot of building work going on nearby which made it quite noisy in the morning but possibly completed now.\\n",
                    "date": "17 Oct 2019, 3:37 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\nCheck out the AKA properties, there are several across Manhattan - (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103420695\\', \\'\\');}, \\'log_autolink_impression\\');Central Park, Times Square, Sutton Place and United Nations. They have two bedroom suites and are suited for longer stays. \\n\\n\\n\\nJust be mindful that some of them only have weekly housekeeping rather than daily if that would be an issue.\\n",
                    "date": "17 Oct 2019, 6:35 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103421019\\', \\'\\');}, \\'log_autolink_impression\\');Beekman Towers might also be an option...Midtown East\\n\\nhttps:/\\xe2\\x80\\xa6short-term-stays\\n",
                    "date": "17 Oct 2019, 7:16 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\nMost Residence Inns have a few 2bd/2ba suites with eat-in kitchen/livingroom.\\n",
                    "date": "17 Oct 2019, 7:29 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103433392\\', \\'\\');}, \\'log_autolink_impression\\');Beekman Tower is smart looking and not wildy expensive.\\n",
                    "date": "17 Oct 2019, 10:32 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Two Bedroom Family Suites in NYC \\n",
                    "body": "\\n\\n\\n\\nThank you so much everyone! This definitely gives me some options to consider.\\n",
                    "date": "18 Oct 2019, 7:10 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12984354-Itinerary_help_for_1st_timer-New_York_City_New_York.html",
            "title": "\\nItinerary help for 1st timer ",
            "body": "\\n\\n\\n\\nI need a little help figuring out how to group some of must-do's on what days, etc. This is our first time, it is my husband and I and our 9 year old daughter. We are flying in Sat morning, Dec. 21 at 9:30am, and fly back to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103413685\\', \\'\\');}, \\'log_autolink_impression\\');Charlotte on Tues, Dec. 24, at 11am. We are staying at the Hilton Garden Inn at Times Square, so pretty central to a lot of things, I think. We plan to walk everywhere, unless weather doesn't allow that. Then we will take the subway or taxi.\\n\\n\\n\\nWe already have tickets to the Rockettes Christmas Spectacular on Sun. night at 10pm. The other things that we really want to do are:\\n\\n\\n\\nTop of the Rock\\n\\nCentral Park-just walk around, daughter wants to stop in at the Plaza hotel\\n\\nRockefeller Plaza tree and area\\n\\nStore Christmas displays one night\\n\\nMacy's Santa visit\\n\\nDUMBO and walk back across the Brooklyn Bridge, preferably around sunset\\n\\nNew York Botanical Garden\\n\\nAmerican Museum of Natural History, if time\\n\\n9/11 Memorial if time, but may do that on another visit\\n\\n\\n\\nWe are mainly trying to do the Christmas stuff, since we can only do that at this time of year, and do plan to hopefully visit again at a non-Christmas time. Any help arranging what to do on what days would be greatly appreciated. And any other recommendations for must see's at Christmas? Thanks!\\n",
            "date": "16 Oct 2019, 9:35 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nWhich airport are you using?\\n",
                    "date": "16 Oct 2019, 9:39 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nshroog, you need to get a hold of a good tourist's map. It will make planning so much easier, because you'll see where the sights are in proximity to each other.\\n\\nThe one I like best is the Red Map of Manhattan neighborhoods:\\n\\nhttps://redmaps.com/products/nyc-map\\xe2\\x80\\xa6\\n\\nThis is a beautiful, color-coded, laminated map that you can spread out onto a table. The family can plan together.\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103413861\\', \\'\\');}, \\'log_autolink_impression\\');New York Botanical Garden is an outlier for such a short trip. It will take at least half a day. If you want to commit that much time, great. But you might want to think about it.\\n\\nWalking over the Brooklyn Bridge can be *very* cold at that time of year. Winds whipping over the bridge can make 40 degrees feel like 20. The weather might be good, though. A few years ago it was a strange 65 degrees on Christmas, so anything can happen.\\n\\nNote: Visits to Santa at Macy's must be reserved.\\n\\n\\n\\nIs your nine-year old going to be awake for a show that starts so late? You can do all of these prior to the show -- they're nearby: \\n\\nTop of the Rock (entrance is half a block from Radio City)\\n\\nCentral Park-just walk around, daughter wants to stop in at the Plaza hotel\\n\\nRockefeller Plaza tree and area \\n\\nStore Christmas displays one night\\n",
                    "date": "16 Oct 2019, 9:45 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nWe are flying into (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103414005\\', \\'\\');}, \\'log_autolink_impression\\');LGA, and will only have carry-ons, so plan to do the Q70 to the subway to the stop right near our hotel.\\n",
                    "date": "16 Oct 2019, 9:54 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nLooks like most of your stuff is midtown so transportation shouldn't be an issue / walking s.b. fine.\\n\\n\\n\\nfor the other stuff - NYBG, 9-11 Memorial, you'll obviously need to take some form of transportation. And you do want to group geographically to minimize back-and-forth time, which I think is the point of your post. I like google maps on my phone, which has Subway, Bus, Walk, (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103414055\\', \\'\\');}, \\'log_autolink_impression\\');Car options\\n\\n\\n\\nmaybe do some practice trips, while referencing MTA maps on desktop computer\\n\\nhttps:/\\xe2\\x80\\xa6subway_map_web_2.pdf\\n\\n\\n\\nI think above should give you some orientation. The major outlier is NYBG but that comes up here from time to time, search here for info/directions, and of course their website should have directions.\\n\\n\\n\\nthe main thing I want to mention, hopefully the weather will be ok but if it gets bad (very cold with rain/snow), taxis/ubers etc can be hard to come by (I had uber call me once saying they couldn't make it) so give yourself an extra hour if the weather is bad and you're planning to take a cab/uber somewhere\\n",
                    "date": "16 Oct 2019, 9:57 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103414123\\', \\'\\');}, \\'log_autolink_impression\\');NYC is big and things are spread out. Some of your plans will be great for good long walks. Others will need transportation. Don't let your desire to walk end up skewing you to be focused primarily on things near midtown as it is really worthwhile to get into other neighborhoods. Otherwise you end up with too many images of skyscrapers and crowded sidewalks IMO. \\n\\n\\n\\nI'd also encourage you to mix Christmas activities with other things. While some of the Christmas things are unique, others aren't really THAT unique and it's good to balance in some of the fundamentally fantastic NYC things with some of the \"special but maybe not world class fantastic\" seasonal things.\\n\\n\\n\\nFor the short visit, I wonder if the Botanical Garden is really worth your time investment vs doing something else. Yes, there is a special train show but unless you have a very strong interest in trains as a hobby, do something else... even if it's not specifically about Christmastime.\\n\\n\\n\\nAdd to your Christmas activities the Winter Village at Bryant Park (near Times Square) There is ice skating and nice holiday market vendor stalls plus some food stalls. It can get very crowded so try to go at a less crowded time. Probably earlier in the day is less crowded than late.\\n\\n\\n\\nNote that you will need to make reservations for Macy's santa. Keep an eye on Macy's Santaland for info about when timed tickets are released. https:/\\xe2\\x80\\xa6\\n\\n\\n\\nOne more benefit of planning a few non-Christmas things is it can give you a break from crowds. You may really need that. If it gets overwhelming, plan to stroll around some quieter-but-interesting neighborhoods.\\n",
                    "date": "16 Oct 2019, 10:01 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nGreat info LizzieandIzzy! Yes, she will be fine staying up late. I hope. We are always up late on different vacations, and she has no problem, so hopefully that will be the same here. I specifically chose late because of I don't want to waste any daylight in a show, plus it's cheaper at that time. lol\\n\\n\\n\\nHow long does it take to do a nice stroll and see the sites, through (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103414139\\', \\'\\');}, \\'log_autolink_impression\\');Central Park? I'm thinking we could spend all day Sunday doing that and checking out the Plaza, maybe some other must see's around, along with Rockefeller Plaza, some shopping, try and do TOTR at sunset, and then dinner and Rockettes. If that is all doable? Then, we still have Sat to do whatever, and all day Monday. Maybe Monday we could do 9/11 Memorial, DUMBO area, and walk across the bridge (weather permitting). And, Santa and store displays Mon night. I don't want to try to cram too much into the trip, because then I will miss too much of the moments, you know what I mean?\\n",
                    "date": "16 Oct 2019, 10:02 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nLarryD and Christnp2 -very good points! Thank you! I did forget about (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103414261\\', \\'\\');}, \\'log_autolink_impression\\');Bryant Park and the Winter Village-I would like to hit that. And, walk by/through some landmarks. I think I may nix the New York Botanical Garden. My daughter and husband would love the train display, but they aren't really that into trains or anything, and I think it may not be worth it. Maybe we can hit the American Museum of Natural History instead-we all would enjoy that.\\n",
                    "date": "16 Oct 2019, 10:11 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nHere is some info. on getting to the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103416064\\', \\'\\');}, \\'log_autolink_impression\\');New York Botanical Garden. You could leave from Grand Central Terminal (42nd and Park Ave./Vanderbilt Ave.), taking a MetroNorth train. The directions say it's a 20-minute ride. Then you walk a bit to the entrance. It's not hard. The Garden is HUGE so you might want to focus on getting to the destination, if you'll do it.\\n\\nhttps://www.nybg.org/visit/directions/\\n\\nTickets for the train show: When I went into the site for tickets, a pop-up came up with an offer for 30% off for early ticket buyers. *That* is a welcome good deal, because the tickets are expensive.\\n\\nThe theme this year is Central Park. CP will probably be very cold on your dates. It might be fun to visit the train show and get an idea of what you can see in CP, and then go later -- even on your next trip.\\n\\nI think 9 is a perfect age for this. \\n\\nOkay, I admit I'm sounding a bit biased. I'm thinking about taking my 9-year old niece there this year. ;-)\\n",
                    "date": "17 Oct 2019, 12:07 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nThanks for the info on the NYBG. I had nixed it, but now it's back in my mind! lol\\n",
                    "date": "17 Oct 2019, 6:50 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Itinerary help for 1st timer \\n",
                    "body": "\\n\\n\\n\\nHere is my suggested itinerary:\\n\\n\\n\\nDay 1\\n\\nAfternoon Tea at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455910\\', \\'\\');}, \\'log_autolink_impression\\');Palm Court (Plaza Hotel)-it is pretty laid back (not rushed) but good. \\n\\nRock Center Tree and decorations (maybe TOTR) A majority of the Best Decorations are on 5th Ave between Rock Center and the Plaza.\\n\\nRock Center Cafe is a good dinner option.\\n\\nDay 2\\n\\nMaybe do Santa this day since you have Rockettes at night, if you are up to it (and you get an early time for Santa) work in Central Park walk and possibly AMNH in the afternoon.\\n\\n\\n\\nDay 3\\n\\nAfter Breakfast you could take the E (Subway) Train downtown to the last stop (World Trade), The Foot Print Fountains are free, and The West FIeld Center and Brookfield Place Winter Garden are some high lights in the immediate surrounding area. If you want to lunch at OWO or Gigino Wagner Park there are views of the Statue of Liberty from either. After walk across Wall St and take the east river Ferry over to DUMBO. Maybe Jane's Carousel if it is open, or walk across Bridge. If it is too cold or you are too tired you can have dinner (a couple decent pizza options) and catch the East river ferry back to Manhattan and take the N or R subway liine from City Hall back uptown.\\n\\n\\n\\nNote: That Palm Court also offers breakfast if you want to do that another day\\n\\n\\n\\nWhatever you decide...\\n\\n\\n\\n...Happy Planning & (most importantly) Have Fun!\\nEdited: yesterday, 08:13 ",
                    "date": "19 Oct 2019, 8:09 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986615-Hilton_Millenium_Downtown_Hotel-New_York_City_New_York.html",
            "title": "\\nHilton Millenium Downtown Hotel ",
            "body": "\\n\\n\\n\\nHi We have 3 nights mid (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103433974\\', \\'\\');}, \\'log_autolink_impression\\');cruise and they have booked us into above hotel.It looks super but worried if it's too far out? As like everyone want to see a show,Times Square etc.\\n\\nWe can change it to a comparable but no idea where to start so help needed.\\n\\nMany thanks Jules\\n",
            "date": "17 Oct 2019, 11:16 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nThat hotel is close to downtown sights -- the 9/11 Museum and Memorial; ferry for the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434122\\', \\'\\');}, \\'log_autolink_impression\\');Statue of Liberty and Ellis Island; Wall Street, etc.\\n\\nIf you can easily do 20- to 40 stairs, you can take the subway to see a show and to see Times Square. Otherwise you might use a bus, taxi, or car service.\\n\\nThe sights in NYC are quite spread out. Did you have anything else on your itinerary?\\n\\n\\n\\nYou might want to pick up a good tourist's map so you can better get the lay of the land. One great one is the Red Map of NYC: https://redmaps.com/products/nyc-map\\xe2\\x80\\xa6\\n",
                    "date": "17 Oct 2019, 11:27 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nI\\xe2\\x80\\x99ve stayed there and would again. It\\xe2\\x80\\x99s very conveniently located to many subway lines, which makes it easy to get to the theater district, museums on the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434292\\', \\'\\');}, \\'log_autolink_impression\\');Upper East Side, etc. As already written above, it\\xe2\\x80\\x99s walking distance to many sites in Lower Manhattan.\\n\\n\\n\\nI saw three shows on that trip and had no difficulty getting back to the hotel afterwards using the subway.\\nEdited: 17 October 2019, 23:40 ",
                    "date": "17 Oct 2019, 11:39 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nSights are spread out in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434381\\', \\'\\');}, \\'log_autolink_impression\\');New York City. Some are, like already stated, within walking distance of your hotel. You are also pretty close to Tribeca where you can find many good restaurants.\\n\\n\\n\\nThe good thing about staying in that area is that it is on the southern tip of Manhattan, where the island is narrower. This means you'll have many subway lines and stations nearby. You can easily reach Times Square, for shows, Upper West Side for American Museum of Natural History as well as Upper East side and the Met Museum without having to change a subway line. \\n\\n\\n\\nI haven't stayed at that particular hotel, but in hotels within walking distance several times. I find it easy to often get decent rates and since I use the subway system extensively when in town, I would gladly stay in the area again.\\n\\n\\n\\nOn my latest visti, I stayed a few minutes walk south of that hotel and had two nights at the theatre in the Times Square area, two ballets in Met Opera house as well as a concert in Madison Square Garden booked. So easy to get there and back to the hotel!\\nEdited: 17 October 2019, 23:45 ",
                    "date": "17 Oct 2019, 11:44 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nIt's more conveniently located to everything than the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434445\\', \\'\\');}, \\'log_autolink_impression\\');cruise ship that's for sure. The 11 subway lines around there will get you anywhere you need to go within 15 minutes. It's like asking if staying in a main inner section of London is too far away. No place is near everything, but everything is a short ride a way.\\n",
                    "date": "17 Oct 2019, 11:50 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nWhat a super quick reply.\\n\\nSounds perfect.\\n\\nOne quick question,Are subways okay to use at night after a show.\\n\\nSorry to sound somewhat naive.We are well travelled but just but a little older.Also on a budget.\\n\\nIs the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434602\\', \\'\\');}, \\'log_autolink_impression\\');Cruise Terminal a long distance.\\n\\nMany thanks Jules\\n",
                    "date": "18 Oct 2019, 12:01 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nYES. Subways are very safe to use after shows. Around that time, a lot of people will use the subway. I've been going solo to and from shows from that area, and I've always used the subway at those hours. Subways are both very good for budget minded people since it's time and cost efficient. On my latest visit (a two week long one), I only used taxis / (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434649\\', \\'\\');}, \\'log_autolink_impression\\');car services to and from the airport because my luggage was to heavy for me to schlep on the stairs in the subway. For all my in-town travels, I used subway and local buses. And I \"was all over the place\" as far as activities and locations visited.\\n",
                    "date": "18 Oct 2019, 12:05 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nAs others have said the hotel is downtown and *great* location to see all that is downtown. Potentially great views as well if you are high enough.\\n\\n\\n\\nYes you'll have to subway or cab/uber to midtown for your show / (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434692\\', \\'\\');}, \\'log_autolink_impression\\');Times Square. I'd advise giving yourself 30-45 minutes, maybe longer if weather is bad (and you're taking taxi/uber) or you're traveling at rush hour. In fact, if weather is bad, I'd skip surface transportation and stick to the subway.\\n\\n\\n\\nYou're sort of right, downtown is not midtown (times square, broadway) but I've grown to love staying downtown as do many others. You just have to know your transportation options.\\n",
                    "date": "18 Oct 2019, 12:07 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nMy teen daughter and I (female) returned from one show after meeting my cousin for a bite to eat after the show. It was after midnight and we felt perfectly comfortable by ourselves. Most other subway trips we were with my husband. I\\xe2\\x80\\x99m sure you will be fine.\\n",
                    "date": "18 Oct 2019, 12:15 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434989\\', \\'\\');}, \\'log_autolink_impression\\');Cruise Port is 1/2 mile from the nearest subway station. Most hotels in NYC are closer to the subway than that. \\n\\nSo the Cruise Port is not really in a remote location; but compared to any hotel you choose, it can be thought of as more remote, a full half mile from the subway :^))) \\n\\nSo you are thinking in less-dense-area terms; everything is convenient on the island of Manhattan, except for the crowds that sometimes slow you down. Don't worry; it's 4 avenues west of the 50th St station of the C train. Or you can take a taxi from your hotel or from the center of Times Square or anywhere. Staying \"all the way\" downtown is 5 miles from the Cruise Port, and almost everything famous is in those 5 miles.\\n",
                    "date": "18 Oct 2019, 12:25 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Hilton Millenium Downtown Hotel \\n",
                    "body": "\\n\\n\\n\\nI think I missed what (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103435501\\', \\'\\');}, \\'log_autolink_impression\\');cruise terminal they are leaving? from - \"mid cruise\" is also confusing - do you actually spend 3 nights in Manhattan in the middle of your cruise? Most overnights mid sailing are just for one night. And you just use the ship as your hotel.\\n\\n\\n\\nWe've stayed downtown several times and at the Hilton once, and I concur about the great location.\\n",
                    "date": "18 Oct 2019, 1:02 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12985155-Tims_Square_New_Years_Eve-New_York_City_New_York.html",
            "title": "\\nTims Square New Years Eve ",
            "body": "\\n\\n\\n\\nMy girlfriend and I are staying at the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103419662\\', \\'\\');}, \\'log_autolink_impression\\');Hilton Times Square New Years eve. We aren't really keen on the idea of waiting in a pen for 8-10 hours. We are slightly contemplating doing one of these expensive rooftop views of the ball drop. A couple questions before we make our decision. What happens if we leave our hotel at around 9pm and start trying to make our way to a \"pen.\" Will we just genuinely not be able to see anything at all, or will we just be incredibly far back. We aren't too concerned with the distance or what kind of view we have, just as long as we get to see it.\\n\\n\\n\\nAlso, I read somewhere NYPD does not allow free movement on the sidewalks in times square. Will this affect our ability to get to a given destination? Are there times where we can move vs times we can't?\\n",
            "date": "17 Oct 2019, 4:40 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nhttps://www.tripadvisor.com/ShowTopic-g28953\\xe2\\x80\\xa6\\n\\n\\n\\n^\\n\\nPrevious answers.\\n",
                    "date": "17 Oct 2019, 4:41 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nUnderstood. It was recommended in the previous answers to post in the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103419828\\', \\'\\');}, \\'log_autolink_impression\\');New York City forum as opposed to just the state.\\n\\n\\n\\nThanks for your feedback.\\n",
                    "date": "17 Oct 2019, 4:57 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nYou won't be able to freely walk through the frozen zone, without proof you're staying in a hotel there or have reservations for a restaurant party or something like that. The NYPD have the final say on allowing people to move around.\\n\\n\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103421774\\', \\'\\');}, \\'log_autolink_impression\\');Times Square official website has lots of information about that night including street closures, take a read: https:/\\xe2\\x80\\xa6nye-faq\\n\\n\\n\\nSome people like to go to a restaurant such as Bubba Gumps or Brooklyn Diner to have meal, some celebrations, and then go out to the sidewalk at midnight and see the ball drop. These cost a few hundred dollars per person and the restaurants sell tickets on a lottery system. You might be lucky or you might not.\\n",
                    "date": "17 Oct 2019, 8:32 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nFrom what I understand, Bubba Gump's no longer uses a lottery system but sell tickets. I have no idea if there are still tickets available, but as stated, they will be on the pricey side.\\n",
                    "date": "17 Oct 2019, 7:35 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103430741\\', \\'\\');}, \\'log_autolink_impression\\');Brooklyn Diner also doesn\\xe2\\x80\\x99t use a lottery system.\\n",
                    "date": "17 Oct 2019, 7:40 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nThanks for the clarification.\\n",
                    "date": "18 Oct 2019, 2:59 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nWe ended up going with the Bubba Gump tickets through evenbrite. Really appreciate the feed back, especially @ter1413 , a lot of useful information was provided. thanks guys.\\n",
                    "date": "18 Oct 2019, 6:15 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nWhy in the world use Event Brite? Why not buy directly from Bubba Gump. Always much better to get from the sight itself rather than some 3rd party seller who may or may not be reliable. Have heard bad things about Event Brite. Check postings here for info.\\n",
                    "date": "18 Oct 2019, 7:20 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\nEvenrbrite is just a ticketing service that has smaller fees than ticketmaster.\\nEdited: 18 October 2019, 07:47 ",
                    "date": "18 Oct 2019, 7:46 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Tims Square New Years Eve \\n",
                    "body": "\\n\\n\\n\\n#8.....because Bubba Gump\\xe2\\x80\\x99s is using Eventbrite to sell their NYE tickets. Did you even bother to look? Do you have any first hand experience with Eventbrite that you consider \\xe2\\x80\\x9cbad\\xe2\\x80\\x9d? \\n\\n\\n\\nPersonally, I never had an issue with Eventbrite. Always reliable and I get the tickets within 5 minutes.\\n",
                    "date": "18 Oct 2019, 4:12 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990187-Restaurant_recommendation-New_York_City_New_York.html",
            "title": "\\nRestaurant recommendation ",
            "body": "\\n\\n\\n\\nHi coming to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103466796\\', \\'\\');}, \\'log_autolink_impression\\');NYC in mid November with my wife for her 40th. Looking for a restaurant on a Tuesday night, somewhere nice preferably with a good view but not top top end \\xf0\\x9f\\xa5\\xb4. Thanks in advance.\\n",
            "date": "19 Oct 2019, 11:51 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Restaurant recommendation \\n",
                    "body": "\\n\\n\\n\\nBudget/entr\\xc3\\xa9e in US$? Cuisine likes & dislikes?\\n",
                    "date": "19 Oct 2019, 11:52 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Restaurant recommendation \\n",
                    "body": "\\n\\n\\n\\nIt is really hard for New Yorkers to figure out what someone means by \"nice with a good view but not top end.\" Restaurants in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103466888\\', \\'\\');}, \\'log_autolink_impression\\');New York City are generally expensive but we're used to it, so not sure what you mean. Real estate is super expensive, so restaurants with a \"good view\" tend to be pricey. Do you mean a rooftop? Or water view?\\n\\n\\n\\nCheck out Industry Kitchen on the East River, The Fulton, with great views of the Brooklyn Bridge on the East River, Perry Street with view of the Hudson River, Manhatta on the 60th floor of a building in the Financial District. Eataly Downtown has some interesting views. Or you may like the Boathouse in Central Park. If those aren't in your price range, please be more specific with a dollar range.\\n",
                    "date": "19 Oct 2019, 11:59 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Restaurant recommendation \\n",
                    "body": "\\n\\n\\n\\nIf you don't want top end dining, and the likes of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468512\\', \\'\\');}, \\'log_autolink_impression\\');Manhatta are too top end for you, you could easily choose any nice restaurant without a view and then go to a rooftop bar for a few cocktails. There are many rooftop bars in NYC with a view. There's bound to be a few near your hotel. Tell us your preferences and location and we can help out.\\n",
                    "date": "20 Oct 2019, 2:26 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Restaurant recommendation \\n",
                    "body": "\\n\\n\\n\\nLook at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468558\\', \\'\\');}, \\'log_autolink_impression\\');Celestine in DUMBO. We enjoyed the food there as much as the view.\\n",
                    "date": "20 Oct 2019, 2:31 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Restaurant recommendation \\n",
                    "body": "\\n\\n\\n\\nI have a question for which, I hope, the answers will help the OP: aren't rooftop bars closed in November except for 230 Fifth which offers igloos in which case the view cannot be that great?\\n",
                    "date": "20 Oct 2019, 2:58 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Restaurant recommendation \\n",
                    "body": "\\n\\n\\n\\n230 Fifth is one that's open in winter.\\n\\n\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468896\\', \\'\\');}, \\'log_autolink_impression\\');Refinery Rooftop is another. That has a heated terrace. \\n\\n\\n\\nWestlight over in Williamsburg, Brooklyn has the best view of Manhattan I've ever seen, and that's open in winter. It has indoor and outdoor spaces.\\n\\n\\n\\nMore on here: https:/\\xe2\\x80\\xa6\\n",
                    "date": "20 Oct 2019, 3:07 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990443-Cuban_food_near_dream_midtown-New_York_City_New_York.html",
            "title": "\\nCuban food near dream midtown ",
            "body": "\\n\\n\\n\\nHello! I\\xe2\\x80\\x99m visiting (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468624\\', \\'\\');}, \\'log_autolink_impression\\');New York soon with my boyfriend and would like to try Cuban food. I\\xe2\\x80\\x99m looking for something close to the hotel (the dream midtown) for our first night. I\\xe2\\x80\\x99ve been looking at victors cafe or guantanamera. Both have good reviews. Would you recommend one over the other? Or is there another spot that\\xe2\\x80\\x99s better? Neither one of us has tried Cuban food before and both are in our price range\\n",
            "date": "20 Oct 2019, 2:37 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Cuban food near dream midtown \\n",
                    "body": "\\n\\n\\n\\nFor a first time, either would be fine I'd say. They get good reviews. I think I would choose (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468833\\', \\'\\');}, \\'log_autolink_impression\\');Guantanamera mainly because it's out of the main theater crowd.\\n",
                    "date": "20 Oct 2019, 3:00 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Cuban food near dream midtown \\n",
                    "body": "\\n\\n\\n\\nI happen to like (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468982\\', \\'\\');}, \\'log_autolink_impression\\');Guantanamera, but it is a \"neighborhood place\", with slightly lower standards than the more \"touristy\" (not necessarily a slam ... ) Victor's. I would say that Victor's is worth the extra money if you're willing to walk there. One problem with Guantanamera is weekend crowding. It's much smaller than Victor's.\\n\\n\\n\\nVictor's is a little closer to Broadway theaters.\\n\\n\\n\\nYou can't be sure about ethnicity in NYC! The okay Mexican restaurant almost next to Guantanamera is run by a Dominican business. Similar price and standards.\\n",
                    "date": "20 Oct 2019, 3:15 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Cuban food near dream midtown \\n",
                    "body": "\\n\\n\\n\\nI have had bad service at victors. The food is just ok. The room is lovely.\\n",
                    "date": "20 Oct 2019, 3:16 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Cuban food near dream midtown \\n",
                    "body": "\\n\\n\\n\\nI just remembered there is a Cuban BUFFET restaurant on the next corner, 56th Street and Eighth Avenue, with a woman's first name in the title. I've never been inside, but the windows provide a good view. Maybe zero seating, but huge menu. There is another Cuban buffet, Tina's, not open much past 6PM, at 23 West 56th between Fifth and Sixth Avenue. It has some seating. Of course food is not as freshly prepared in a buffet restaurant.\\n",
                    "date": "20 Oct 2019, 3:18 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Cuban food near dream midtown \\n",
                    "body": "\\n\\n\\n\\nBut a buffet would provide you with a wide variety of tastes.\\n\\n\\n\\nWe've eaten at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103470143\\', \\'\\');}, \\'log_autolink_impression\\');Havana Central which is decidedly Midtown but I wasn't impressed with the food at all, although it was a lovely place with lots of ceiling fans and palm plants.\\n\\n\\n\\nI've also eaten at more authentic Cuban restaurants in Miami and I now know it's not one of my favorite cuisines, but worth it if you just want to try.\\n",
                    "date": "20 Oct 2019, 5:22 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Cuban food near dream midtown \\n",
                    "body": "\\n\\n\\n\\n>>>I just remembered there is a Cuban BUFFET restaurant on the next corner, 56th Street and Eighth Avenue, with a woman's first name in the title.<<<\\n\\n\\n\\nWould that be Sophie\\xe2\\x80\\x99s Cuban Cuisine? I\\xe2\\x80\\x99ve been there for lunch several times (they have multiple locations around town), and enjoyed it...very much a fast lunch spot atmosphere, though, so I don\\xe2\\x80\\x99t know about it for dinner. They do have seating.\\n\\n\\n\\nIt\\xe2\\x80\\x99s not a serve-yourself buffet; you order and they dish it up for you. Very common in Caribbean restaurants here (and for that matter, in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103477137\\', \\'\\');}, \\'log_autolink_impression\\');Puerto Rico...don\\xe2\\x80\\x99t know about Cuba). The various long-cooked/soupy-stewy dishes don\\xe2\\x80\\x99t suffer from that treatment. (In fact, I suspect they\\xe2\\x80\\x99d be held in similar containers in the kitchen in a non-buffet restaurant.)\\n",
                    "date": "20 Oct 2019, 4:27 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988536-Which_Hotel_3_days_in_December-New_York_City_New_York.html",
            "title": "\\nWhich Hotel 3 days in December? ",
            "body": "\\n\\n\\n\\nTaking daughter (age 19) to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452180\\', \\'\\');}, \\'log_autolink_impression\\');New York City for her first time right before Christmas and she was/is huge fan of Eloise and Home Alone. Would like to keep room rate around $1,000 + taxes/fees etc. It looks like The Plaza has availability in a Deluxe King with a roll-away for her. Other option is the Four Seasons with a Gotham Junior Suite 2 double beds. Not sure if this Four Seasons location (57th street) is ideal for our itinerary (primarily shopping, Christmas windows, Rockettes, fine dining, carriage ride). We prefer to use cabs and walking as our primary mode of transportation (no subways) and will be flying in/out of Newark (EWR). Any and all suggestions greatly appreciated.\\n",
            "date": "19 Oct 2019, 12:58 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nI would never do two doubles if I could have a king and a roll-away.\\n\\nThe Four Seasons is close to everything you have on your list to do, even a block or two closer than (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452300\\', \\'\\');}, \\'log_autolink_impression\\');the Plaza in some instances.\\n\\nFine dining is certainly possible but may require a cab ride.\\n\\n\\n\\nHave you considered any other hotels?\\n",
                    "date": "19 Oct 2019, 1:06 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nWhich three days (2 nights?) are you considering? The first weekend in December is arguably the most expensive of any all year, except over New Year's.\\n",
                    "date": "19 Oct 2019, 1:07 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nCan't imagine using a roll-away rather than a real bed. Exactly what dates - I'm sure there must be othr choices. Is this for 3 people or just 2?\\n",
                    "date": "19 Oct 2019, 1:15 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nTo answer questions....\\n\\n3 people (husband, self, daughter (age 19)\\n\\nWeek before Christmas\\n\\nLooked at NY Edition on friends rec.(too sterile and cold and same price point), (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452616\\', \\'\\');}, \\'log_autolink_impression\\');Beekman (too similar to a hotel here in town-The Brown Palace), Surrey (not \"fancy\" enough for daughter - this is her Christmas gift), Mandarin Oriental, St Regis, Baccarat, (the later 3 still considering as well).\\n",
                    "date": "19 Oct 2019, 1:31 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nOther 5* properties (may not be on search engines like booking.com):\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452623\\', \\'\\');}, \\'log_autolink_impression\\');Baccarat Hotel (28 West 53rd between 5th & 6th Aves.)\\n\\nSt. Regis (55th off of 5th Ave.)\\n\\n1 Hotel Central Park (1414 Sixth Avenue at 58th St.)\\n\\nMandarin Oriental (80 Columbus Circle)\\n\\nThe Pierre (2 East 61st (across street from Central Park))\\n\\nRitz-Carlton (50 Central Park South)\\n\\n\\n\\nYou can walk to any of your activities/sights from the above. Another hotel you might consider that's a little farther away (and it will be quieter!) is The Surrey (20 East 76th, off of Fifth Avenue). Very easy to get a bus or taxi on Fifth.\\n",
                    "date": "19 Oct 2019, 1:31 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nHow about The Peninsula, too?\\n",
                    "date": "19 Oct 2019, 1:36 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nDoes \"Week before Christmas\" mean that your dates are flexible? We can't search being respectful of your budget unless you provide exact dates (or at least, tell us they're flexible, and from when to when).\\n",
                    "date": "19 Oct 2019, 1:41 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nRollaways can be uncomfortable. Try to get two proper beds.\\n\\n\\n\\nWhat are your exact dates? NYC hotel prices fluctuate all the time but especially in December. Closer to Christmas is actually less expensive than early in Dec.\\n\\n\\n\\nYou mention location of the Four Seasons and your plans. I'm not sure why you think that 57th st is less convenient for fine dining. Fine dining is all over the city. Many of the best fine dining restaurants aren't even in midtown. Of those that are in midtown, they aren't all clustered in one specific area.\\n\\n\\n\\nFor shopping, do you know where you plan to go? The Four Seasons on 57th is actually in a great location for some times of high end shopping. So I'm not sure your hesitation about its location.\\n",
                    "date": "19 Oct 2019, 1:57 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nLooking at check in on the 17th and check out on the 20th. 57th st Four Seasons seems great. The Four Seasons in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103453014\\', \\'\\');}, \\'log_autolink_impression\\');Tribeca on Barclay is less expensive but seems to far our and not conveniently located for our itinerary. For shopping-Bergdorfs, Barney's, Tiffany's... \\n\\n\\n\\nA couple other questions....what is the best time of the day or night to see the Christmas windows on 5th?\\n\\n\\n\\nCarriage Rides-daughter has always wanted to do this since watching Eloise when she was very little-\\n\\nWhere is the best, most scenic, safe, area for this? Central Park? We will not be ice skating this trip as she just fell and broke her coccyx bone for the 2nd time! The only planned activity will be seeing the Rockettes. Everything else (other than dinner reservations) will be unscheduled.\\n",
                    "date": "19 Oct 2019, 2:08 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Which Hotel 3 days in December? \\n",
                    "body": "\\n\\n\\n\\nCarriage Rides are (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103453128\\', \\'\\');}, \\'log_autolink_impression\\');Central Park. Make sure fare is agreed upon before getting in the carriage\\n\\n\\n\\nStore windows are fine from 6PM onward\\n",
                    "date": "19 Oct 2019, 2:19 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986255-Getting_to_New_York_City_Marathon_Start_from_Merrick-New_York_City_New_York.html",
            "title": "\\nGetting to New York City Marathon Start from Merrick ",
            "body": "\\n\\n\\n\\nI'm running the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103430894\\', \\'\\');}, \\'log_autolink_impression\\');New York Marathon this year and was wondering if I could get some suggestions on the best way to get to the start line. My brother and sister in law live in Merrick, Long Island so I'll be staying there. My brother in law suggested I just get an uber from their place to the start line because it's only about a 45 minute drive according to google maps.\\n\\n\\n\\nMy other option was staying in the city the night before the marathon and getting the bus from the New York Public Library. Ideally I'd rather not pay $400 or so for a hotel room but I'm worried about making sure that I don't have any issues getting to the start.\\n\\n\\n\\nIf I did get an uber what time would I have to leave to get to the start line before the bridge closes?\\n\\n\\n\\nThanks,\\n\\n\\n\\nJustin\\n",
            "date": "17 Oct 2019, 7:51 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nDoes bro know the cost? -An Uber could easily cost $200 from Merrick, I think. See if you can check the price before making the decision. You could take a (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103430978\\', \\'\\');}, \\'log_autolink_impression\\');Long Island Railroad train but then you,d have to get to a bus pickup or make your way.\\n",
                    "date": "17 Oct 2019, 7:57 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nThe lower level of the Verrazano closes at 7 am so you'd have to leave pretty early https:/\\xe2\\x80\\xa62171304-street-closures \\n\\nYou might see if there are guest rooms available at the YMCA https://ymcanyc.org/guest-rooms The Vanderbilt location is reasonably close to the library\\n",
                    "date": "17 Oct 2019, 8:16 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nI believe the Verrazzano closes at 7am, but you should check the race website. If you go the Uber route (which I agree with NYWhiz is going to be expensive!), you need to allow extra time for congestion (and to allow your driver to get back over the bridge after dropping you off). All in all, this doesn\\xe2\\x80\\x99t strike me as a good plan. \\n\\n\\n\\nYou don\\xe2\\x80\\x99t mention which wave you\\xe2\\x80\\x99re starting in, or whether you signed up for any of the official transportation options to the start. Hopefully you can still do do (I\\xe2\\x80\\x99m not running this year, so I\\xe2\\x80\\x99m not up to speed on the current deadlines). The preferred method is no longer the bus from midtown, but the ferry.\\n\\n\\n\\nEspecially if you\\xe2\\x80\\x99re in one of the later waves, you should be able to spend the night in Merrick and take public transit to the start...but you really need to check the ferry schedule and the sign up procedures. You can find all this on the race website. \\n\\n\\n\\nGood luck, and have a great race!\\n",
                    "date": "17 Oct 2019, 8:18 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nI drove some folks to the start from (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103431579\\', \\'\\');}, \\'log_autolink_impression\\');Brooklyn back in 2011. I think I had returned to the hotel by 6:30-6:45 and the area was already quite crowded. I don't think Uber is a good option, check the others as Linda says.\\n",
                    "date": "17 Oct 2019, 8:37 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nYou could stay at a downtown (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103431600\\', \\'\\');}, \\'log_autolink_impression\\');Brooklyn Hotel and get to the Ferry with a 10 minute subway ride. BUT, That still doesn't get you to the west end of the Verrazano Bridge. \\n\\nMaybe you could stay at one of the hotels along 3rd and 4th Avenue and Brooklyn, take the 95th St-bound \"R\" train to 86th St (in Brooklyn), and get a Staten Island City bus (or taxi) across the bridge. It's just that Brooklyn hotels will probably not be as expensive as Manhattan hotels. A typical one (of many) is the Sleep In on 22nd St and 3rd Avenue (in Brooklyn).\\n\\nAnd the Bridge does not close to cars, just the lower level (there are two levels to the Bridge, 6-8 lanes on each level. The runners go on the lower level only.\\n",
                    "date": "17 Oct 2019, 8:38 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nThe Westside YMCA is close to the finish line and a straightforward subway ride to the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103431680\\', \\'\\');}, \\'log_autolink_impression\\');Staten Island ferry on the 1 train to South Ferry http://web.mta.info/maps/submap.html\\n\\nIf you take the Long Island Rail Road into Penn Station you could take 1 train from there also\\nEdited: 17 October 2019, 20:44 ",
                    "date": "17 Oct 2019, 8:41 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nYou indicate there is a bus from the NY (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103432020\\', \\'\\');}, \\'log_autolink_impression\\');Public Library ( I assume this is a special bus for the marathon) Why not take the LIRR to Manhattan? It WILL be an early start.\\n",
                    "date": "17 Oct 2019, 9:06 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\n>>>And the Bridge does not close to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103432046\\', \\'\\');}, \\'log_autolink_impression\\');cars, just the lower level (there are two levels to the Bridge, 6-8 lanes on each level. The runners go on the lower level only.<<<\\n\\n\\n\\nThis is absolutely not true. Runners are on both levels, and the bridge closes completely. (In fact, the upper level closes much earlier.) \\n\\n\\n\\nAlso, when I spoke of ferries, I was referring to the race-day ferries that are designed to get runners to the start. This is done via shuttle buses, no need to arrange other transportation. It\\xe2\\x80\\x99s really not complicated.\\n\\n\\n\\nPlease, don\\xe2\\x80\\x99t make this harder than it needs to be!\\n",
                    "date": "17 Oct 2019, 9:08 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\n#5 - See the link to the road closures in #2 above. - both bridge levels do close\\nEdited: 17 October 2019, 21:15 ",
                    "date": "17 Oct 2019, 9:14 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Getting to New York City Marathon Start from Merrick \\n",
                    "body": "\\n\\n\\n\\nSorry; I really thought it was only partial. My error, Kaye.\\n",
                    "date": "17 Oct 2019, 9:27 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12989122-Recommendation_for_vegan_pizza_in_Brooklyn-New_York_City_New_York.html",
            "title": "\\nRecommendation for vegan pizza in Brooklyn ",
            "body": "\\n\\n\\n\\nSo we plan to walk the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103457648\\', \\'\\');}, \\'log_autolink_impression\\');Brooklyn bridge from Manhattan side and check out the Dumbo neighborhood. Wife and daughter are vegan so wondering which place to go for savoring the world famous Brooklyn pizza.\\n",
            "date": "19 Oct 2019, 10:22 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Recommendation for vegan pizza in Brooklyn \\n",
                    "body": "\\n\\n\\n\\nDellarocco's in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103464875\\', \\'\\');}, \\'log_autolink_impression\\');Brooklyn Heights.\\n\\nDellarocco's: https://docs.wixstatic.com/ugd/5ee8ee_2d0e42\\xe2\\x80\\xa6 \\n\\nThis is what Juliana's says about vegetarian/vegan: \"While none of our menu items are certified vegan or vegetarian, there are several choices one could make to avoid animal and dairy products: our lentil soup, each of our salads and our Marinara pizza are all animal- and dairy-free.\"\\n",
                    "date": "19 Oct 2019, 9:15 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Recommendation for vegan pizza in Brooklyn \\n",
                    "body": "\\n\\n\\n\\nThanks Lizzie. Is that place close to where we walk out of the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103467238\\', \\'\\');}, \\'log_autolink_impression\\');Brooklyn bridge? ..\\n",
                    "date": "20 Oct 2019, 12:28 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12989091-Bars_with_Live_Music-New_York_City_New_York.html",
            "title": "\\nBars with Live Music? ",
            "body": "\\n\\n\\n\\nSo, I usually come in to the city for my birthday and my tradition the last few years is a night out at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103456492\\', \\'\\');}, \\'log_autolink_impression\\');Cafe Wha in the village. Unfortunately, this year, they have a theme night (Funk Music) which isn't my cup of tea. I was curious if anyone has any suggestions for any bars or places with live music where I can enjoy a few drinks, sing (horribly) and dance.\\n\\n\\n\\nThanks!\\n",
            "date": "19 Oct 2019, 9:57 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Bars with Live Music? \\n",
                    "body": "\\n\\n\\n\\nOur favorite haunt for live music, food and drink is the Iridium, a (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103457744\\', \\'\\');}, \\'log_autolink_impression\\');NYC institution:\\n\\n\\n\\nhttps://www.theiridium.com/Events\\n\\n\\n\\nCH\\n",
                    "date": "19 Oct 2019, 10:36 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Bars with Live Music? \\n",
                    "body": "\\n\\n\\n\\nThank you for the suggestion. I\\xe2\\x80\\x99ll look it up. \\xf0\\x9f\\x91\\x8d\\xf0\\x9f\\x8f\\xbc\\n",
                    "date": "19 Oct 2019, 6:02 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Bars with Live Music? \\n",
                    "body": "\\n\\n\\n\\nBleeker street between 6th ave and (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103463742\\', \\'\\');}, \\'log_autolink_impression\\');LaGuardia has several bars with live bands to choose from. Also www.ohmyrockness.com has a great night life calendar. They cover a lot of the live music happening in NYC.\\n\\nHappy planning & have fun !\\n",
                    "date": "19 Oct 2019, 7:42 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Bars with Live Music? \\n",
                    "body": "\\n\\n\\n\\nAwesome, thank you!\\n",
                    "date": "19 Oct 2019, 8:30 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990100-Best_Breakfast_in_NYC-New_York_City_New_York.html",
            "title": "\\nBest Breakfast in NYC ",
            "body": "\\n\\n\\n\\nwill be visiting the week before Thanksgiving and staying close to the financial district. Looking for recommendations for a good Ny Breakfast. Not too worried where or about price. Thanks\\n",
            "date": "19 Oct 2019, 10:55 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Best Breakfast in NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103466263\\', \\'\\');}, \\'log_autolink_impression\\');Augustine. Yum! Walking distance.\\n\\n\\n\\nOr Norma's if you want a subway ride. Sadelle or Balthazar are other options.\\n",
                    "date": "19 Oct 2019, 11:06 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Best Breakfast in NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103466329\\', \\'\\');}, \\'log_autolink_impression\\');Augustine! You are already in the area.\\n\\nThat said: how does one define \"best breakfast in NYC\". It's all subjective and depending on one's palate. The venue is gorgeous. \\n\\nOne more thought: it's a French Bistro and my idea of a \"French breakfast is a delicious croissant and coffee\".\\nEdited: yesterday, 23:12 ",
                    "date": "19 Oct 2019, 11:09 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Best Breakfast in NYC \\n",
                    "body": "\\n\\n\\n\\n>>>Looking for recommendations for a good (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103466813\\', \\'\\');}, \\'log_autolink_impression\\');New York breakfast. Not too worried where or price <<\\n\\n\\n\\n\\n\\nGreat omelettes & Coffee at L \\xe2\\x80\\x98 Express in Gramercy near Union Square Park. \\n\\nhttps://lexpressnyc.com/\\n\\n\\n\\nWonderful American Diner Atmosphere and pretty good food @ Good Stuff Diner Near-ish Union Square park again. https://www.goodstuffdiner.com/Welcome.tpl\\n\\n\\n\\nWonderful southern style american food at Bubby\\xe2\\x80\\x99s .Two locations one in Tribeca and one near the Highline /Chelsea market. Delicious delicious food.\\n\\nhttps://www.bubbys.com/\\nEdited: yesterday, 23:52 ",
                    "date": "19 Oct 2019, 11:51 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Best Breakfast in NYC \\n",
                    "body": "\\n\\n\\n\\nI agree that breakfast at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476649\\', \\'\\');}, \\'log_autolink_impression\\');Norma's is delicious, you do need a reservation if you don't want to wait (https://www.parkernewyork.com/eat/normas/)\\n\\nI would also suggest Pershing Square across from Grand Central Terminal (https://pershingsquare.com/)\\n\\nFor everyday, I like Le Pain Quotidien (https://www.lepainquotidien.com/us/en/menu) they have many locations\\n",
                    "date": "20 Oct 2019, 3:37 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Best Breakfast in NYC \\n",
                    "body": "\\n\\n\\n\\nYou've been given some great options already.\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476763\\', \\'\\');}, \\'log_autolink_impression\\');Locanda Verde is another.\\n",
                    "date": "20 Oct 2019, 3:49 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12984770-First_trip_to_NY-New_York_City_New_York.html",
            "title": "\\nFirst trip to NY ",
            "body": "\\n\\n\\n\\nMy husband and I are coming to NY June 4-9 of 2020, for our 1 year anniversary. I have researched myself to death and confused myself even more with my research. I am trying to find a good location to stay in. We arrive at LGA airport. We are interested in seeing time square, (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103416963\\', \\'\\');}, \\'log_autolink_impression\\');Central Park, World Trade Center, Statue of Liberty, Brooklyn bridge, Rockefeller center. We may do a broadway show but not totally sure. We aren\\xe2\\x80\\x99t really into theatre, art, or music too much. We do like history, shopping, good food, and seeing the main attractions. Any advice on where to stay, the best way to go about seeing these sites, also any other advice I may be missing is great. Thanks again for any help.\\n",
            "date": "17 Oct 2019, 1:06 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nWe would be glad to help.\\n\\n\\n\\nIf you post your budget (including 15% tax), you can help us help you.\\n\\n\\n\\nCongratulations!\\nEdited: 17 October 2019, 01:17 ",
                    "date": "17 Oct 2019, 1:16 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nEasy answer: Stay anywhere you want that you can afford; no hotel is near everything, but every hotel is near something.\\n\\nThe way you get around is to take the subway or a taxi (or even walk) to go from one place to another. Everything you mentioned is in a 5 mile x1.5 mile rectangle. The place isn't all that big, but it's crowded so every neighborhood changes every half mile.\\n\\nI personally would suggest staying near (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103417259\\', \\'\\');}, \\'log_autolink_impression\\');Rockefeller Center or just south of Central Park; it's close to but not in Times Square (too noisy, too crowded with all those tourists), and where I mentioned looks prettier than many others and is near many famous things (but not all, remember that, nothing is).\\n\\nBut if the cost is too high, any place on the island of Manhattan south of 99th St is good, just not west of 10th Avenue (because of inconvenience and grittiness, not danger).\\n",
                    "date": "17 Oct 2019, 1:28 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nTo clarify, the reply 2 is for hotel recommendations. We also would like desired bedding configuration.\\n\\nGet ahold of a guidebook (library/purchase) & use the maps to group your locations or perhaps purchase a paper tourism map. Since attractions are spread out all over, the most convenient/cost effective way of getting around is the subway.\\n\\nFor the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103417362\\', \\'\\');}, \\'log_autolink_impression\\');Statue of Liberty, get your tickets ASAP from Statue Cruises if you want to set foot on Liberty Island. BTW, it's Times Square with an s (so that you don't get a spoof web site & so that Trip Advisor will link you to their site.\\n\\nI recommend a guidebook so that you are finding the attractions that interest you - not anyone else. For example, I would recommend museums & theater but that's not your thing so I wouldn't want to give you advice as to what *you* should see.\\nEdited: 17 October 2019, 01:35 ",
                    "date": "17 Oct 2019, 1:34 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103417434\\', \\'\\');}, \\'log_autolink_impression\\');Statue of Liberty: https://www.statuecruises.com/\\n\\nand Absolutely NO OTHER site if you want to actually set foot on the island and see the Pedestal of the Statue from the inside. Crown tickets, which are hard to get, would not be a requirement for me.\\n\\nIf you go through another website, all they do is mark up and resell tickets from the site stated here.\\n\\nMost of where you are going is on a grid pattern of streets, and there are 20 numbered streets to a mile, and 7 numbered avenues to a mile, so Rockefeller Center is at 50th and 5, the Empire State Building is at 34th and 5th (as examples). That's less than a mile.\\n",
                    "date": "17 Oct 2019, 1:41 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nI honestly don\\xe2\\x80\\x99t have a budget. Hoping to not go over 300 a night with taxes. Not sure if that\\xe2\\x80\\x99s possible though. The cheaper the better but location and a good hotel is important.\\n",
                    "date": "17 Oct 2019, 3:40 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nThanks for all the help so far. We are looking for a queen bed or bigger. It\\xe2\\x80\\x99s just the two of us going. I don\\xe2\\x80\\x99t want to share a bathroom though with anyone. Normal hotel.\\n",
                    "date": "17 Oct 2019, 3:41 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nYou might consider the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103420312\\', \\'\\');}, \\'log_autolink_impression\\');Moxy Times Square. (King--refundable).\\n\\n\\n\\nThere are other choices for King/Queen. They are within budget for non-refundable--but not for refundable (non-refundable is not desirable this far out.).\\n\\n\\n\\nOne alternative is to book an acceptable refundable room--and reconsider as time goes on.\\nEdited: 17 October 2019, 05:50 ",
                    "date": "17 Oct 2019, 5:49 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nBooking.com has The Marmara Park Ave showing a Standard Guest Room (290sqft) for $1324.00 in total for your whole stay. It has a large double bed. That's a good hotel and that's a refundable rate, so if you see something better later you can cancel that one. \\n\\n\\n\\nIf you increased your budget to $1720.00 in total you will get an extra large double bed and a Deluxe room (slightly bigger again).\\n\\n\\n\\nThe location is good, it's close to the 6 train on 33rd St and walkable to a great eating neighbourhood in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103421882\\', \\'\\');}, \\'log_autolink_impression\\');NoMad. It's also fairly close to the ESB.\\n\\n\\n\\nThe 6 train will get you both uptown and downtown.\\n\\n\\n\\nAlso check direct with the hotel's website to compare the rates offered.\\n",
                    "date": "17 Oct 2019, 8:45 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nAynat, do you happen to know the dimensions of the \"large double\" or \"extra large\" double beds? Whenever I see that I think, what happened to good old fashioned \"double,\" \"queen,\" \"king\"? The hotels seem to tout a \"large double\" as if it were a queen.\\n",
                    "date": "17 Oct 2019, 6:51 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: First trip to NY \\n",
                    "body": "\\n\\n\\n\\nThe so-called 'Midtown' area is a good location, so as long as the hotel is not too close to the hustle and bustle of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103435624\\', \\'\\');}, \\'log_autolink_impression\\');Times Square. I'm staying at Courtyard by Marriott, Herald Square next July.\\n",
                    "date": "18 Oct 2019, 1:11 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990607-Traveling_from_Boston_to_Hartford_to_NYC-New_York_City_New_York.html",
            "title": "\\nTraveling from Boston to Hartford to NYC ",
            "body": "\\n\\n\\n\\nWe will be doing some college visits the 3rd week in March, and I'm just starting to figure out the logistics of getting from (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103469742\\', \\'\\');}, \\'log_autolink_impression\\');Boston to Hartford to NYC. Hoping to rely on trains, public transport and uber for this trip, but I'm willing to rent a car if it's necessary. We plan to fly into Boston and out of NYC. \\n\\n\\n\\nAny advice for transportation options between these cities? I appears there is not a direct train from Boston to Hartford or from Hartford to NYC. Both seem to transfer trains in New Haven. We hope to be in Boston for 2-3 nights, Hartford area for 1 night, and then NYC for 2-3 nights.\\n",
            "date": "20 Oct 2019, 4:28 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Traveling from Boston to Hartford to NYC \\n",
                    "body": "\\n\\n\\n\\nNo need to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103470780\\', \\'\\');}, \\'log_autolink_impression\\');rent a car.\\n\\n\\n\\nBoston to Hartford is a bus route. Several buses a day, around $20, around two hours.\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nAs for the Hartford to NYC train, some involve a change of trains in New Haven and some are direct.This schedule shows which are which.\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6Northeast-Schedule-W04-092319.pdf\\n",
                    "date": "20 Oct 2019, 6:57 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Traveling from Boston to Hartford to NYC \\n",
                    "body": "\\n\\n\\n\\nYou can easily do it by Amtrak if you change in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103470929\\', \\'\\');}, \\'log_autolink_impression\\');New Haven. So - Boston to New Haven to Hartford and later Hartford to New Haven to NYC. Be sure to buy tickets as soon as your dates are set in order to get the best discount prices. Remember tickets are train specific - you can;t change to another one without turning i your ticket and buying a more expensive one (determined by how soon the train is).\\n",
                    "date": "20 Oct 2019, 7:22 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Traveling from Boston to Hartford to NYC \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103470994\\', \\'\\');}, \\'log_autolink_impression\\');Boston to New Haven to Hartford is a sort of roundabout route. Much more direct to take the bus.\\n",
                    "date": "20 Oct 2019, 7:29 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990037-Hotel_choice-New_York_City_New_York.html",
            "title": "\\nhotel choice ",
            "body": "\\n\\n\\n\\nHello, currently have a 2 night res booked at Executive (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103465770\\', \\'\\');}, \\'log_autolink_impression\\');Le Soleil for the end of next week. Giraffe and The Refinery popped up with availability. Curious about what you would recommend of these three. Plan on shopping, Central Park, a broadway show and just winging it. Thank you!!\\n",
            "date": "19 Oct 2019, 10:27 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: hotel choice \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103467868\\', \\'\\');}, \\'log_autolink_impression\\');Giraffe and Refinery are nicer more upscale hotels but Executive Le Soleil is perfectly fine. What,s the price difference? Have you checked resort fees?\\n\\n\\n\\nGiraffe is in a quieter location (more local) vs the others but it also makes it further from the park and theaters. Look on\\n\\nMaps.google.com\\nEdited: today, 01:26 ",
                    "date": "20 Oct 2019, 1:26 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990400-Best_way_from_Newark_Terminal_B_to_Holiday_Inn_Times_Square-New_York_City_New_York.html",
            "title": "\\nBest way from Newark Terminal B to Holiday Inn Times Square ",
            "body": "\\n\\n\\n\\nWhat is the most efficient way to go from (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468415\\', \\'\\');}, \\'log_autolink_impression\\');Newark to Holiday Inn Times Square on 8th street. This is for 5 persons... so I was wondering if its the same cost with a taxi/uber vs bus/train. Thank you.\\n\\n\\n\\nAlso any recommendations for highlights to see for teenagers (15 years olds). I was thinking of buying the NY Explorer pass for 3 or 4 options for Hop on Hop off, Top of the Rock Ob. and Empire SB. WE will be there from Friday afternoon until Monday morning.. so not a lot of time.\\nEdited: today, 02:15 ",
            "date": "20 Oct 2019, 2:15 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Best way from Newark Terminal B to Holiday Inn Times Square \\n",
                    "body": "\\n\\n\\n\\nYou need to have a good look at a map of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468509\\', \\'\\');}, \\'log_autolink_impression\\');NYC since you are very confused. Your hotel is not o 8th St - which is far downtown - nowhere near Times Square. I assume you mean 8th Ave, which is a completely different thing.\\n\\n\\n\\nThat hotel is 585 8th Ave, which is between 38th and 39th St and on the west side. You need to understand how addresses work in NYC or you will just be wandering aimlessly and lose a lot of time. \\n\\n\\n\\nTaking the Airtrin to NJ Transit to Penn Station and then walking to your hotel (5/6 short blocks - about 1/4 mile) will cost $65 for all 5 of you. A car service or taxi for 5 will be more since you have to add tolls ($18) and the usual 20% tip for the driver to the basic fare quoted. Check with Uber or Dial 7 or Carmel what they will charge for a vehicle large enough for 5 people plus however much luggage you have.\\n",
                    "date": "20 Oct 2019, 2:26 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Best way from Newark Terminal B to Holiday Inn Times Square \\n",
                    "body": "\\n\\n\\n\\nThe 15 year olds are most likely very computer savvy & can do research on what they - not us - think they should do in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103470903\\', \\'\\');}, \\'log_autolink_impression\\');NYC.\\n\\nMost of us do not recommend passes as you may find they don't save you as much as they advertise. Also for attractions like the Top of the Rock that have timed tickets, you don't get tickets with passes, you get vouchers & when you get to an attraction with timed tickets, you could find that the most convenient times are sold out. Also, I personally don't recommend any Hop On Hop Off bus ride in anything but comfortable weather as I was once taken on a HOHO in cool damp weather & sitting on top (where the best seats are) I froze.\\n",
                    "date": "20 Oct 2019, 7:19 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Best way from Newark Terminal B to Holiday Inn Times Square \\n",
                    "body": "\\n\\n\\n\\nHighlights for teens? What do they like to do? When are you visiting?\\n",
                    "date": "20 Oct 2019, 4:28 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988179-SoL_Crown_Access_Children-New_York_City_New_York.html",
            "title": "\\nSoL Crown Access Children? ",
            "body": "\\n\\n\\n\\nDoes anyone know what the minimum suggested age is for (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103449063\\', \\'\\');}, \\'log_autolink_impression\\');Statue of Liberty crown access?\\n\\n\\n\\nAlso has anyone attempted it with children under 10? \\n\\nMany thanks\\n",
            "date": "18 Oct 2019, 8:57 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nThere is no age requirement but there is a height requirement (4 foot tall) https:/\\xe2\\x80\\xa6\\n",
                    "date": "18 Oct 2019, 9:11 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nI remember my father taking us to climb the crown when we were about 11 - 12. We were very active and fit. But I will tell you, unless your child is used to climbing dozens and dozens of stairs, it's quite exhausting. The crown climb is the equivalent of about 20 (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103450820\\', \\'\\');}, \\'log_autolink_impression\\');flights. I was hating my dad for bringing us there. It was very hot, too, in the middle of the summer. I don't recall anything at all about the view. What I remember is not being able to get my breath on the way up, and my legs having turned to jelly by the time we had to go down -- it was very, very hard. \\n\\nDad was fine, by the way.\\nEdited: 18 October 2019, 23:07 ",
                    "date": "18 Oct 2019, 11:06 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nI wouldn't take my kids up into the SOL Crown. Nothing spectacular. Stairs are too narrow inside. No windows only on the crown so it's quite suffocating inside. Once inside It's hard to back out, you have to continue to the top and go with the flow. The single line on the stairs goes only one way up and single line one way down. It's not that high that gives a \"WOW\" factor, unlike OWO, (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103450969\\', \\'\\');}, \\'log_autolink_impression\\');Top of the Rock or ESB. The only thing that's worth it going up is to cross it off your bucket list and you can say \" been there, done that!\" Summer time is brutal to be inside the statue.\\n",
                    "date": "18 Oct 2019, 11:17 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nHow much under 10? I've done it twice though as an adult (and love it both times), but did take my 12 year old niece up one of those times. I would not want to do it on a hot summer's day (no AC). I'd say it depends on the kid\\n",
                    "date": "18 Oct 2019, 11:20 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nIt's a spiral staircase that gets narrower and narrower as you get higher and higher up; you are inside the bronze robes. There is an UP spiral staircase that forms a helix with the DOWN Staircase. I also went when I was 12; I loved it; my father was exhausted. I tried with my wife in the 1970s; she made it up one turn of the steps and switched to the Down staircase and vowed never to try it again. If the kid is an explorer type, it might be great; will the two of you be able to take it, especially if it's 90 degrees outside? I'd wonder about that more.\\n\\nOh, and when you get to the top, you get to look out windows in the crown itself. Then you climb back down all those hundreds of spiral steps again. \\n\\nSome people read this and say: Cool! Some read it and say, Not ME!\\n\\nThen again, I've gone down the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103451373\\', \\'\\');}, \\'log_autolink_impression\\');Washington Monument, up and down the Baltimore version of the Washington Monument, the \"Monument\" in London, the Clock tower in Strasbourg, the Catwalk in the Duomo in Florence, If you are that type, have fun. My wife has done none of these.\\nEdited: 18 October 2019, 23:48 ",
                    "date": "18 Oct 2019, 11:46 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nClimbing the statue was a big treat we looked forward to every summer. I don't recall a height restriction, but I started when I was around seven or eight. We'd race all the way up to the crown, and we loved every minute. If your child is excited about the challenge, great. If he/she has to be dragged, then I'd pass on it.\\n",
                    "date": "18 Oct 2019, 11:54 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nNorthofDC - I thought the statue was made of copper, not bronze. On my first visit to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103451478\\', \\'\\');}, \\'log_autolink_impression\\');NYC in July 1995 long before security limited the number of daily visitors, we waited in the line to go up. However, it was boiling on the ground and staff were coming along the line telling people that the temperature inside the statue was 20 degrees warmer than outside. We quickly changed the plan and went to just the pedestal museum instead, before heading to EI.\\n",
                    "date": "18 Oct 2019, 11:58 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nIf your child is tall enough to easily manage the steps an used to climbing lots of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452212\\', \\'\\');}, \\'log_autolink_impression\\');flight of stairs then ask is they are interested. For kids not used to a lot of stairs - perhaps not a good idea. I would not even try with a kid a lot shorter than 4'. Also shoes are important since the stairs are metal with a lot of openings. Sandals will not work at all.\\n",
                    "date": "19 Oct 2019, 1:01 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nYes, it's copper; as a kid everyone said it was bronze, because it was green, and there hadn't yet been writers who wrote in detail about any renovations. So we didn't know any better. And I haven't changed; just ask my wife: Ba da boom!\\n",
                    "date": "19 Oct 2019, 2:37 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: SoL Crown Access Children? \\n",
                    "body": "\\n\\n\\n\\nBronze is an alloy that is primarily copper so they oxidize in similar ways and once the patina is formed it can protect the underlying metal from further corrosion.\\n\\nBronze is more suited to investment castings (like most statues).because of the additives.\\n\\nIIRC the exterior of the SOL is not load bearing and only a little thicker than a penny coin.\\n",
                    "date": "19 Oct 2019, 2:48 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988340-NYC_with_9_year_old_11_29_12_1-New_York_City_New_York.html",
            "title": "\\nNYC with 9 year old 11/29-12/1 ",
            "body": "\\n\\n\\n\\nWe are taking our daughter to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103450453\\', \\'\\');}, \\'log_autolink_impression\\');NYC Thanksgiving Weekend. We are planning to do the Rockettes and the American Girl Store. We would also like to go to the Statue of Liberty and my husband would like to go by the 9-11 Memorial. What is the best way to plan this and any other must sees for a 9 year old girl that we can squeeze in there?\\n",
            "date": "18 Oct 2019, 10:37 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: NYC with 9 year old 11/29-12/1 \\n",
                    "body": "\\n\\n\\n\\nYou should book tickets for the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103450699\\', \\'\\');}, \\'log_autolink_impression\\');Statue of Liberty immediately. The only official seller is www.statuecruises.com. Try to get the first tickets of the day. The later in the day you book, the longer the security line to get onto the ferry. Crown tickets are probably sold out, but you may find Pedestal tickets. The ticket includes a stop at Ellis Island, where thousands of immigrants came into the U.S. This excursion will take up at least 3- to 4 hours, not including transport to get to Battery Park for the ferry. It would be easy to view the 9/11 Memorial before or after.\\n\\n\\n\\nDepending upon what time the Rockettes get out, you could visit the American Girl store right after. (I don't know where you could store your packages if you were to go before -- I don't think Radio City has package storage, but I could be wrong.) They are literally a half block from each other (AG is on 51st between 5th & 6th. Radio City is on 6th Ave. between 50th & 51st). You could also visit FAO Schwarz, which is now located in Rockefeller Center. Again, it's about a half block from Radio City. It's on Rockefeller Plaza, in the middle of 49th St. between 5th & 6th Aves. \\n\\nIf the weather is good, you could also go up to Top of the Rock. It's also right there -- less than a half block from Radio City.\\n\\n\\n\\nWhere are you staying?\\n",
                    "date": "18 Oct 2019, 10:58 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: NYC with 9 year old 11/29-12/1 \\n",
                    "body": "\\n\\n\\n\\nActually going to the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103451020\\', \\'\\');}, \\'log_autolink_impression\\');Statue of Liberty is a big time investment. Follow Lizzy's instructions for booking tickets if you are sure that you want to prioritize it for this short trip. Another option would be to do a sightseeing cruise for good views of Lady Liberty from the water, along with other views. This is a more relaxed and comfortable trip, but you don't get to be right on Liberty or Ellis Islands.\\n\\n\\n\\nIs your daughter into science, nature and animals? (including dinosaurs)? If yes, a visit to the American Museum of Natural History is a great option. If she is into art and artistic artifacts, then The Met is iconic. Do one or the other, not both. \\n\\n\\n\\nAll of the Holiday windows will be up on the big department stores. Plus there are special holiday markets that will be going (Bryant Park in Midtown has a good one). Also consider splurging on a Broadway show. Sure, the Rockettes are festive but not quite the same as a full Broadway show. \\n\\n\\n\\nCentral Park is a great way to spend a few hours with a 9 year old unless you have terrible weather. At that time of year you may even have just a bit of color left on the trees.\\n",
                    "date": "18 Oct 2019, 11:20 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: NYC with 9 year old 11/29-12/1 \\n",
                    "body": "\\n\\n\\n\\nIt would help to know the times of your train arrival and departure. You could have almost 3 full days or really only 1 full day and 2 half days, making a big difference in what you can do. Do remember how mobbed the city will be these few days, making everything slower.\\n",
                    "date": "19 Oct 2019, 12:42 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: NYC with 9 year old 11/29-12/1 \\n",
                    "body": "\\n\\n\\n\\nJust a caution. There is a 9/11 Memorial which is the free open air area around the 9/11 Museum. (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455386\\', \\'\\');}, \\'log_autolink_impression\\');The Museum has an admission charge & is not recommended for children under 10 - per the Museum.\\n",
                    "date": "19 Oct 2019, 6:51 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986905-Best_Food_Tour_for_great_eats_and_good_sightseeing-New_York_City_New_York.html",
            "title": "\\nBest Food Tour for great eats and good sightseeing? ",
            "body": "\\n\\n\\n\\nLooking for some recommendations. Don\\xe2\\x80\\x99t mind a lot of walking.\\n",
            "date": "18 Oct 2019, 1:58 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436453\\', \\'\\');}, \\'log_autolink_impression\\');Eating With Ziggy tours are good. Many people on the forum have done them.\\n\\n\\n\\nThere is a walking/food tour of Hell's Kitchen, a walking/food tour of East Village and a full day Brooklyn tour in a private vehicle.\\n\\n\\n\\nLots of history, points of interest and of course food.\\n",
                    "date": "18 Oct 2019, 2:11 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nI second the Ziggy tours, we did the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436518\\', \\'\\');}, \\'log_autolink_impression\\');East Village tour, great food, lots of walking, lots of very interesting history around the East Village. I would book another tour when visiting again.\\n",
                    "date": "18 Oct 2019, 2:15 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nZiggy is the legend in food tours.\\n",
                    "date": "18 Oct 2019, 2:16 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nI would do (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103436771\\', \\'\\');}, \\'log_autolink_impression\\');the Brooklyn tour of Ziggy's if you mostly stick to Manhattan as many do, so that you get a different view of NYC.\\n",
                    "date": "18 Oct 2019, 2:35 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nWow! Ziggy\\xe2\\x80\\x99s sounds like a winner. Thanks everyone!\\n",
                    "date": "18 Oct 2019, 3:17 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nYeah, Ziggy is a forum regular and offers a great service.\\n",
                    "date": "18 Oct 2019, 3:31 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nYou mention wanting a lot of walking. I think Ziggy's (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103437508\\', \\'\\');}, \\'log_autolink_impression\\');East Village tour is great for that. The Brooklyn tour includes driving to cover neighborhoods across many miles, with less walking.\\n",
                    "date": "18 Oct 2019, 3:34 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Best Food Tour for great eats and good sightseeing? \\n",
                    "body": "\\n\\n\\n\\nI did (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103437702\\', \\'\\');}, \\'log_autolink_impression\\');East Village last year and have booked Hell's Kitchen this November. Hope to do Brooklyn next year. Highly recommend.\\n",
                    "date": "18 Oct 2019, 3:52 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12903464-2_x_queen_bed_rooms-New_York_City_New_York.html",
            "title": "\\n2 x queen bed rooms ",
            "body": "\\n\\n\\n\\nHi we have booked to arrive in NY 16-22nd Dec(6 nights).any advice or recommendations would be greatly appreciated. \\n\\nWe would like 2 rooms\\n\\nOne with 2 queen beds to accommodate 2 adults and 2 children. (9,12) they will share a bed. \\n\\nThe other with at least 2 double for my mum and brother. \\n\\nHave been looking near (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-102751196\\', \\'\\');}, \\'log_autolink_impression\\');Bryant Park so that we can have ice skating and Xmas market near by.\\n\\nWant to do all the normal sightseeing, especially anything Christmas themed. \\n\\nBudget for double room would like to be $250 max per night. To include all taxes and breakfast if possible. \\n\\nWe are happy to pay a little more for 2x queen room.\\n\\nTIA\\n",
            "date": "11 Sep 2019, 10:42 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-102753844\\', \\'\\');}, \\'log_autolink_impression\\');The Hotel at Times Square is a well run budget hotel about a 10 min. walk to Bryant. Park (despite it,s name \\xe2\\x98\\xba\\xef\\xb8\\x8f) it has both 2 double and 2 queen rooms and includes a basic breakfast. The rates start at ~$200/night plus taxes and fees. If you want to stay flexible, even the cancelable rates are close to budget. \\n\\nApplecorehotels.com\\n\\n\\n\\nSpringhill Suites is newer and nicer and closer to Bryant Park but will be over budget even with prepay rates of $245-$270 plus taxes..\\n",
                    "date": "11 Sep 2019, 1:06 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\nThe Fairfield Inn and Suites (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-102755208\\', \\'\\');}, \\'log_autolink_impression\\');Times Square South (not far from Bryant Park, a 15 min walk)) has a Two Queen Bed room special rate for members at $213.00 per night (ex tax) and you can join online. Look at their Deals and Specials for that room. They also have a free buffet breakfast.\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n",
                    "date": "11 Sep 2019, 3:07 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\nThe Mondrian has lovely 2 x queen rooms with a view of the ESB f you're lucky!\\n",
                    "date": "12 Sep 2019, 2:59 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\nLooks nice but over budget, only doubles and no breakfast\\n",
                    "date": "12 Sep 2019, 3:28 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\nThank you\\n",
                    "date": "12 Sep 2019, 3:29 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\nthank you\\n",
                    "date": "12 Sep 2019, 3:30 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: 2 x queen bed rooms \\n",
                    "body": "\\n\\n\\n\\nThank you for the replies. We have provisionally booked holiday inn express near (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103475006\\', \\'\\');}, \\'log_autolink_impression\\');Macy\\xe2\\x80\\x99s as it was just in budget with a breakfast. We can cnx York 4 days before if a better deal comes up.\\n",
                    "date": "20 Oct 2019, 12:18 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990826-Street_Parking-New_York_City_New_York.html",
            "title": "\\nStreet Parking ",
            "body": "\\n\\n\\n\\nWalking back to my side street in a random part of Manhattan I saw plastered all over \\xe2\\x80\\x9cno parking Monday Tuesday\\xe2\\x80\\x9d signs. Road work. \\n\\n\\n\\nIt reminded me of a somewhat recent post about finding on- street parking vs paying high garage prices. Typically the move-your-(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103471189\\', \\'\\');}, \\'log_autolink_impression\\');car day is Thursday, so someone could have left a car on my street Friday and thought they were safe until Thursday. These no parking signs just went up midday today. So... hopefully everyone with a car parked here sees them and gets their cars moved in time. \\n\\n\\n\\nIf you leave a car on a random street somewhere, be advised that things like streetwork or movie shoots or what have you can throw you a curve ball. Don\\xe2\\x80\\x99t just leave a car and forget about it...\\nEdited: today, 07:56 ",
            "date": "20 Oct 2019, 7:55 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Street Parking \\n",
                    "body": "\\n\\n\\n\\nJust.a Note: the move your (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103471193\\', \\'\\');}, \\'log_autolink_impression\\');car day is Thursday on my street. Not all streets.\\n",
                    "date": "20 Oct 2019, 7:56 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Street Parking \\n",
                    "body": "\\n\\n\\n\\nA true (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103471435\\', \\'\\');}, \\'log_autolink_impression\\');car-owning New Yorker who doesn't have the big bucks to park the car in a garage have their alternate side of the street parking DOWN like a formula. It is quite aggravating when a TV or movie crew comes in and messes with that formula. My friends live on a block in the East Village that is a popular spot for Law & Order to shoot. They usually give enough of a heads up and they are pros having lived in that same neighborhood for close to 30 years that they can flow with it....but it is still aggravating.\\n",
                    "date": "20 Oct 2019, 8:35 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12991182-Sale_Thanksgiving-New_York_City_New_York.html",
            "title": "\\nSale Thanksgiving ",
            "body": "\\n\\n\\n\\nHello\\n\\n\\n\\nI am in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103475913\\', \\'\\');}, \\'log_autolink_impression\\');New Jersey ( & thus NYC) a week before thanksgiving. Since I am there for a week only, which premium outlets should I go to shop where Sale is on? Please advise so that I am able to see handbags, shoes, clothes at one or two places?\\n\\n\\n\\nThanks a zillion!\\n",
            "date": "20 Oct 2019, 2:15 PM",
            "answers": []
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988618-New_York_City_Gift_Ideas-New_York_City_New_York.html",
            "title": "\\nNew York City Gift Ideas ",
            "body": "\\n\\n\\n\\nHi (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452877\\', \\'\\');}, \\'log_autolink_impression\\');NYC experts. My sister and fiance are spening a week in New York next March for their honeymoon. Thinking of getting them something NYC for a Christmas and/or wedding present. Obviously US Dollars might be a safe choice and i might still do that but I'm wondering if anyone can suggest an alternative gift idea or voucher that they can use out there? They enjoy history, sight seeing and food and drink. Thanks in advance for any help or ideas.\\n",
            "date": "19 Oct 2019, 1:55 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nYou can get food gift cards to many restaurants.\\n\\n\\n\\nHow about paying for a cocktail (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103452965\\', \\'\\');}, \\'log_autolink_impression\\');cruise or something like that?\\n\\n\\n\\nOr pay for a couple of food tours?\\n\\n\\n\\nYou can get all of these online so you could easily buy them and send them the voucher in advance.\\n",
                    "date": "19 Oct 2019, 2:03 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nThere are many types of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103453069\\', \\'\\');}, \\'log_autolink_impression\\');NYC themed things available. Here are two examples to show the range: a compact folding umbrella whose inside shows the Grand Central Terminal ceiling\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6umbrellagct-folding-ceil.html\\n\\n\\n\\nand a 1000 piece jigsaw puzzle of the Statue of Liberty that glows in the dark!\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6B005Z27KO2\\n\\n\\n\\nThere are many books about NYC and the Met Museum bookstore has a corner of them, and Strand Books and another source. There are many residents who look down on the I [heart] NY tee shirts.\\n\\n\\n\\nHowever, the vouchers suggested in the first post are likely a better choice.\\nEdited: yesterday, 02:14 ",
                    "date": "19 Oct 2019, 2:12 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nAre they staying in a hotel w a spa? Or rooftop bar? Arranging a treat of some kind (in room massages?) at the hotel may be nice. \\n\\n\\n\\nCheck with some of the museums to see if there are special events for members while they\\xe2\\x80\\x99re here - a membership in a museum may provide something extra for them. \\n\\n\\n\\nTheater tickets are the obvious gift of course.\\n",
                    "date": "19 Oct 2019, 2:15 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nI might get them a gift certificate for an expensive restaurant that they'd love to try, but otherwise wouldn't go. Do you know what their favored cuisines are?\\n",
                    "date": "19 Oct 2019, 2:16 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nA gift to be sent to their hotel room such as a gift basket with wine and food.\\n",
                    "date": "19 Oct 2019, 2:53 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nTheater Tix. Boom.\\n",
                    "date": "19 Oct 2019, 5:10 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nI think that theater tickets are a great idea if you know what they are planning (you don't want them to have planned a long walking day and be too tired) and if you know the type of theater they like (personally, I don't like musicals, but that's just me).\\n",
                    "date": "19 Oct 2019, 5:22 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nPersonally, I think the idea of US dollars is excellent.\\n",
                    "date": "19 Oct 2019, 7:12 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nI agree with giving US Dollars. Include a (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455687\\', \\'\\');}, \\'log_autolink_impression\\');NYC guide book. Perfect.\\n",
                    "date": "19 Oct 2019, 7:37 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: New York City Gift Ideas \\n",
                    "body": "\\n\\n\\n\\nDinner with a view - River Caf\\xc3\\xa9\\n\\nDinner in a historical place - (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455790\\', \\'\\');}, \\'log_autolink_impression\\');Fraunces Tavern {The place has been open since 1792 & was said to have hosted George Washington.)\\n",
                    "date": "19 Oct 2019, 7:52 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986706-NYC_Marathon_Manhattan_Cruise_Pier-New_York_City_New_York.html",
            "title": "\\nNYC Marathon & Manhattan Cruise Pier ",
            "body": "\\n\\n\\n\\nLeaving on a (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434691\\', \\'\\');}, \\'log_autolink_impression\\');cruise from the Manhattan cruise pier the morning of the NYC Marathon - November 3rd. Trying to gauge whether to stay at a hotel or drive up from the NJ/Philly area the morning of. \\n\\nIs the area accessable near the lots and pier or is a hotel recommended to be in the area the night before?\\n\\nI'm sure we'll be ok if we leave early (or late) enough but just trying to determine if it's just easier to stay the night and already be close or if its not a big deal at all with the marathon happening; that's my only apprehension. \\n\\nThanks for any feedback.\\n",
            "date": "18 Oct 2019, 12:07 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: NYC Marathon & Manhattan Cruise Pier \\n",
                    "body": "\\n\\n\\n\\nThe Pier is not near the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434722\\', \\'\\');}, \\'log_autolink_impression\\');Marathon route (I am assuming that you are leaving from the Pier on the west side). The Marathon is East and north of where the cruises leave from.\\n",
                    "date": "18 Oct 2019, 12:09 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: NYC Marathon & Manhattan Cruise Pier \\n",
                    "body": "\\n\\n\\n\\nNot a big deal.\\nEdited: 18 October 2019, 00:13 ",
                    "date": "18 Oct 2019, 12:12 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: NYC Marathon & Manhattan Cruise Pier \\n",
                    "body": "\\n\\n\\n\\nJust go through the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103435034\\', \\'\\');}, \\'log_autolink_impression\\');Lincoln Tunnel and make a left up 10th or 11th or 12th Avenue. It's a half-mile from where you get out of the Tunnel, and nowhere near any part of the Marathon, which at it closest is a mile to the east and 1 mile north.\\n",
                    "date": "18 Oct 2019, 12:28 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: NYC Marathon & Manhattan Cruise Pier \\n",
                    "body": "\\n\\n\\n\\nThank you!! \\n\\nDriving up in the morning sounds like our best bet!!\\n",
                    "date": "18 Oct 2019, 12:38 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: NYC Marathon & Manhattan Cruise Pier \\n",
                    "body": "\\n\\n\\n\\nI would suggest you do not use 12th Avenue, use 10th instead crossing over on 55th or 51st depending which pier you are sailing from. First time using 12th Avenue, had to exit the vehicle and walk to the terminal because of traffic on12th turning left to the terminal was not moving at all. Second time, used 10th and well worth stopping at each red light on 51st, avoiding all traffic and able to drive(not walk) to terminal.\\n",
                    "date": "18 Oct 2019, 4:50 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990837-Getting_13_people_from_LGA_to_The_Manhattan_Club-New_York_City_New_York.html",
            "title": "\\nGetting 13 people from LGA to The Manhattan Club ",
            "body": "\\n\\n\\n\\nHi all,\\n\\nI'm trying to figure out the best way to get 13 people from (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103471264\\', \\'\\');}, \\'log_autolink_impression\\');LGA to The Manhattan Club on W 56th street on January 1st. I have been looking for a big van to rent, but it seems like it's difficult to find a dependable car service. I would hate to book something and then get stood up.\\n\\nWe have 2 families of 4 and 1 family of 5. Can we get a standard cab for the families of 4 and fit luggage (assuming 3 pieces per family) in the cab? What about the family of 5?\\n\\nI'm open to all options other than taking the subway/train. That seems like a complete disaster with luggage and kids. \\n\\nPlease help and thank you.\\n",
            "date": "20 Oct 2019, 8:08 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Getting 13 people from LGA to The Manhattan Club \\n",
                    "body": "\\n\\n\\n\\nI would just get on line for a taxi and divide everyone up. I guess that means 4 cabs. But that\\xe2\\x80\\x99s likely much easier, and probably cheaper, than any other option if you\\xe2\\x80\\x99re ruling out bus/subway.\\n",
                    "date": "20 Oct 2019, 8:16 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Getting 13 people from LGA to The Manhattan Club \\n",
                    "body": "\\n\\n\\n\\nI used Dial7 from (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476585\\', \\'\\');}, \\'log_autolink_impression\\');LGA last year and except for the taxi driver who was in a bad mood, I didn't have any issues.\\n\\nYou can check online and find discount codes (from $5 to $14) for that company as well.\\n",
                    "date": "20 Oct 2019, 3:30 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12983569-Best_way_from_Flushing_Main_Street_to_Ronkorkoma-New_York_City_New_York.html",
            "title": "\\nBest way from Flushing Main Street to Ronkorkoma ",
            "body": "\\n\\n\\n\\nHi\\n\\nCould you please tell me the best way to get to Ronkorkoma,can we use my unlimited metro card to go there? We have some luggages with us to consider too. \\n\\n\\n\\nMany thanks.\\n",
            "date": "16 Oct 2019, 1:10 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nNo. You can use the Metrocard to get to a connection for the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103407464\\', \\'\\');}, \\'log_autolink_impression\\');Long Island Railroad. Then you take an LIRR train there. So, you can take the #7 train to the Woodside station, then purchase an LIRR ticket to Ronkonkoma. \\n\\nCheck the LIRR website for schedules and fares.\\n",
                    "date": "16 Oct 2019, 1:21 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nI think you mean Ronkonkoma, and if you look at Google Maps, you will see a few ways to do this.\\n\\n\\n\\nThe main part of your voyage will be on the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103407476\\', \\'\\');}, \\'log_autolink_impression\\');Long Island Railroad, which is not part of the MTA system, so your farecard won't work there. It's a commuter train and you need to buy a specific ticket to ride. Plenty of room for your luggage\\n",
                    "date": "16 Oct 2019, 1:22 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103410618\\', \\'\\');}, \\'log_autolink_impression\\');Nassau County buses and the Long Island Railroad (Port Washington Branch) that leave from Flushing will be of no help to you. As mentioned, you will have to take the subway to Woodside and then the Ronkonoma train. You might need to transfer to another train, but the whole trip is about 1 hour 12 mins.\\n",
                    "date": "16 Oct 2019, 6:07 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nYou might also consider a cab to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103410708\\', \\'\\');}, \\'log_autolink_impression\\');Jamaica (with luggage it might be a bit simpler/easier than multiple trains)\\n\\nLIRR map: web.mta.info/lirr/Timetable/lirrmap.htm\\n",
                    "date": "16 Oct 2019, 6:13 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nHere is a map of the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103413308\\', \\'\\');}, \\'log_autolink_impression\\');Long Island Railroad (No Metrocards accepted) Your goal is to get a train that goes through Jamaica to Ronkonkoma. That's why, from Downtown Flushing, either a taxi to Jamaica, or a subway to 61st St-Woodside are you two good choices.\\n\\nweb.mta.info/lirr/Timetable/lirrmap.htm\\n",
                    "date": "16 Oct 2019, 9:07 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nWhat are you doing once you get to Ronkonkama? (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103413821\\', \\'\\');}, \\'log_autolink_impression\\');Renting a car and driving there may be your best option. \\n\\n\\n\\nI tried to look at your post history to see if I could get a better idea of your overall plans and what you were doing in Ronkonkama. I found two threads where you had extensive comments from the forum, but then decided to return to the thread a month later and delete your original post. Why? The forum is for everyone to read, not just for disposable personal advice. Removing your original post means that the thread becomes mostly useless and all of the info that people took time to share is wasted, with no value to anyone else reading later. (sorry if that sounds harsh... you probably haven't thought about it in those terms).\\n",
                    "date": "16 Oct 2019, 9:43 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Best way from Flushing Main Street to Ronkorkoma \\n",
                    "body": "\\n\\n\\n\\nThanks everyone for your contributions. I have googled it and I will take the subway then take the LIRR as you have advised.\\n\\n\\n\\nApologies for deleting one of my previous post and if it was thought that the replies went wasted, that were not although you were right I never thought that others might use them. My reason I had to go to Ronkonkoma si mentioned in previous post was to visit a friend.\\n\\n\\n\\nI appreciate all the help and contributions people put here. Thanks.\\n",
                    "date": "19 Oct 2019, 9:42 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12984641-Christmas_Day_advice_on_where_to_go_for_brunch_please-New_York_City_New_York.html",
            "title": "\\nChristmas Day advice on where to go for brunch please! ",
            "body": "\\n\\n\\n\\nWe arrive in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103415967\\', \\'\\');}, \\'log_autolink_impression\\');New York on 22nd December and are really looking forward to spending Christmas Day in the city.\\n\\nWe will be staying in a small studio apartment between Times Square and Hell\\xe2\\x80\\x99s Kitchen - so, we understand, in the heart of a restaurant area. So most days we are anticipating being spoilt for choice for dinner most evenings.\\n\\nWe\\xe2\\x80\\x99d really like to have brunch out rather than an evening meal on Christmas Day and wondered if anyone could recommend where we should go, please. If it involves a good walk to soak up the Christmas Day atmosphere - and walk off the brunch afterwards - even better!\\n\\nThanks in advance!\\n",
            "date": "17 Oct 2019, 12:00 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nRead this\\n\\n\\n\\nhttps://www.tripadvisor.com/ShowTopic-g60763\\xe2\\x80\\xa6\\n",
                    "date": "17 Oct 2019, 12:05 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nAre you staying with friends or family and sharing their studio apartment? Short term (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103416844\\', \\'\\');}, \\'log_autolink_impression\\');vacation rental apartments are almost all illegal in NYC and that Hell's Kitchen area is particularly notorious for severe abusers of the apartment laws. \\n\\n\\n\\nThere will be a good number of restaurants open for Christmas Lunch and Dinner (usually serving the same meal), but brunch might actually be harder to find as restaurants focus on that big main meal I would focus on places that are open for breakfast. \\n\\n\\n\\nIf you want something special and are open for a longer trip from your hotel (seems like you are), Balthazar in Soho is open on Christmas Day, serving their regular menus with a few additions. I am reasonably certain that they serve breakfast that day. Maybe even their brunch. Check closer to the date and make reservations as soon as they open up 30 days prior. \\n\\n\\n\\nFor something more basic and closer, Westway Diner should be open.\\n",
                    "date": "17 Oct 2019, 12:58 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nThank you! We are in a hotel apartment so definitely legal. It just has a kitchenette.\\n\\nReally helpful suggestions and we will be sure to check them out. Yes, we\\xe2\\x80\\x99re up for long walks so very happy to venture further afield- and stagger back! Happy to have any \\xe2\\x80\\x98type\\xe2\\x80\\x99 of cuisine, just need choice for one non meat eater (me) and a carnivore.\\n",
                    "date": "19 Oct 2019, 12:21 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nThanks a lot. I\\xe2\\x80\\x99ll study that!\\n",
                    "date": "19 Oct 2019, 12:24 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nI doubt you'll find many places offering brunch on Christmas. More likely a Christmas meal that might be served at both lunchtime and dinnertime, or maybe continuously.\\n\\n\\n\\nIf you want eggs, omelets, pancakes, etc. I suggest looking for a diner.\\n",
                    "date": "19 Oct 2019, 2:33 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nI think the smith near (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103462969\\', \\'\\');}, \\'log_autolink_impression\\');Lincoln center is open for brunch on Xmas. That would be a nice walk past the light show at Columbus circle and then a walk into Lincoln center complex which is decorated.\\n",
                    "date": "19 Oct 2019, 6:36 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Christmas Day advice on where to go for brunch please! \\n",
                    "body": "\\n\\n\\n\\nThe lambs club had an Xmas brunch with live singers. You could walk through rock center.\\n",
                    "date": "19 Oct 2019, 7:04 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12976618-Be_prepared_for_the_shock_of_our_disgusting_subway_system-New_York_City_New_York.html",
            "title": "\\nBe prepared for the shock of our disgusting subway system ",
            "body": "\\n\\n\\n\\nI want to warn prospective travelers that the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103347094\\', \\'\\');}, \\'log_autolink_impression\\');NYC subway system has deteriorated tremendously in recent years. \\n\\n\\n\\nNot only are there frequent delays and unpredictable changes because of signal problems, unauthorized activation of brakes, sick or unruly passengers, etc., but both the subway cars and the platforms are often occupied by the homeless with their belongings. Trains sometimes need to be taken out of service because cars have become so filthy from this problem.\\n\\n\\n\\nIt has become so awful, that I usually go out of my way to take longer bus routes rather than to contend with this terrible experience .\\n\\n\\n\\nI hope visitors will think of using other transpiration options when they can. They should always check MTA.info for the latest delays before venturing out or check out NYCT Subway Twitter\\n\\n\\n\\nThe NYC subway system is an embarrassment\\nEdited: 14 October 2019, 06:26 ",
            "date": "13 Oct 2019, 6:20 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nI guess you didn't live here in the 1970s and 1980s. \\n\\n\\n\\nDo you have any recommendations for particularly awful stations (or trains) that people should stay away from?\\n",
                    "date": "13 Oct 2019, 6:22 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\n>>>Trains sometimes need to be taken out of service because (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103347182\\', \\'\\');}, \\'log_autolink_impression\\');cars have become so filthy from this problem.<<<\\n\\n\\n\\nDo you have any evidence for this statement?\\n\\n\\n\\nI agree that there are many problems with the subway system, but riding in proximity to poor people isn\\xe2\\x80\\x99t one of them. I wish stations were in better repair, especially in the outer boroughs, that they were accessible, and that we had a modern signal system to allow trains to run more frequently (when I was in Mexico City, they seemed to come every 2-3 minutes; here I sometimes have to wait 20 minutes for the R train). But the subway is still the best way to get around most of the city, and I hope visitors won\\xe2\\x80\\x99t be dissuaded by this post.\\n",
                    "date": "13 Oct 2019, 6:36 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nI too have read of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103347312\\', \\'\\');}, \\'log_autolink_impression\\');cars being taken out of service BUT this is something that is usually not noticeable. Yes, there are homeless around, but generally you ignore them and they are ignoring! There WAS ( note past tense) an individual who appeared to get his jollys by activating emergency brakes.This happened in the spring and the individual was arrested.\\n\\n\\n\\nYes,trains are late but the impact is nil. I have been riding the subway system for over 50 years. I couldn\\xe2\\x80\\x99t tell you even once, in all those years, what time a given train was scheduled to pull into a given station. No one knows or keeps track. People go to the station and get on the next train. Maybe it should have arrived 5 minutes earlier, - got me! Maybe the train that \\xe2\\x80\\x9cshould\\xe2\\x80\\x9d have been there is still 5 minutes away- irrelevant, I\\xe2\\x80\\x99m on a train!\\n\\n\\n\\nBottom line I live in Queens and will frequently take the train to Manhattan to see a show. I return to Queens, a lone female. My biggest gripe- even though I\\xe2\\x80\\x99m a senior people rarely offer a seat. I think most feel they need to sit and text or play games on their phone.Harder to do when standing!\\n",
                    "date": "13 Oct 2019, 6:54 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\n\"My biggest gripe- even though I\\xe2\\x80\\x99m a senior people rarely offer a seat. I think most feel they need to sit and text or play games on their phone.Harder to do when standing!\"\\n\\n\\n\\nMy parents have told me that people get up for them on the PATH regularly, but never happens on the subway. I am constantly amazed by this.\\n\\n\\n\\nThe tracks are awful from all of the garbage thrown on them. That's not the fault of the MTA, the city, or the state. That's people. We should do better. But I feel the subways are much safer today than they ever were and I ride them more now than I did in all of my years of living in Manhattan. And during the day, they arrive regularly. At night (past 10 or 11), I may wait 20 minutes. I wish that were not so, as they are still crowded.\\n",
                    "date": "13 Oct 2019, 7:03 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\n\"I guess you didn't live here in the 1970s and 1980s.\" Right???? Took the words right out of my mouth.\\n\\n\\n\\nStill one of the best systems in the country in my opinion. It was always gritty and will always be gritty but I get the deferred maintenance issues - hey our power company just turned off power to 2 million people to prevent them from setting the state on fire.\\n",
                    "date": "13 Oct 2019, 7:16 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nI have lived here my entire life! The 1970s and 80s were bad, but its even worse now. Only those who don't really live here are defending the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103347498\\', \\'\\');}, \\'log_autolink_impression\\');NYC subway system. Real New Yorkers know the truth of what they are contending with every day!\\n\\n\\n\\nPlease, tell the truth and don't mislead visitors\\n",
                    "date": "13 Oct 2019, 7:24 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nI\\xe2\\x80\\x99m a frequent visitor to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103347543\\', \\'\\');}, \\'log_autolink_impression\\');New York & use the subway all the time. I\\xe2\\x80\\x99m not going to dispute what you say, as I haven\\xe2\\x80\\x99t had your experience. I will say that I don\\xe2\\x80\\x99t find the subway awful, and it is an incredible value at $2.75 to ride system-wide.\\n",
                    "date": "13 Oct 2019, 7:31 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nI moved here from (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103347572\\', \\'\\');}, \\'log_autolink_impression\\');Boston two years ago and I LOVE the NYC subway. If you want to experience a messed-up subway system, go to Boston where deferred maintenance issues have resulted in incredible delays. A few winters ago, the system came to a grinding halt. It is still a mess and the State has yet to get things squared away. If you search Twitter for #MBTAFail or just #MBTA you will see how fun it is to depend on the trains there. \\n\\n\\n\\nAs I tell my friends back home\\xe2\\x80\\x94-yes there may be rats on the platform or homeless people sleeping in the cars (or even a hoarder occupying an entire section of the car with stacks of rolled up newspapers), there may be a distressed person screaming profanity at random strangers on the train, it may be \\xe2\\x80\\x9cshowtime\\xe2\\x80\\x9d\\xe2\\x80\\x94-BUT the trains, by and large, run during rush hour. In two years I have experienced two delays and they were minor. \\n\\n\\n\\nThe biggest issue is the homeless situation, which is a subway issue but much bigger. Homeless people are all over the city and in the subway. Something needs to be done about that. These people need help. Many are mentally ill. No one should have to live like that.\\nEdited: 13 October 2019, 07:36 ",
                    "date": "13 Oct 2019, 7:35 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nI only ride the Subways on Weekends and the E & F train are almost unuseable , Many times I just drive to the city to avoid using the E & F trains\\n",
                    "date": "13 Oct 2019, 7:38 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Be prepared for the shock of our disgusting subway system \\n",
                    "body": "\\n\\n\\n\\nIf the OP really lives here, obviously s/he should move somewhere with little or no pubic transit.\\n",
                    "date": "13 Oct 2019, 7:45 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12985901-Wheelchair_friendly-New_York_City_New_York.html",
            "title": "\\nWheelchair friendly ",
            "body": "\\n\\n\\n\\nHi,\\n\\n\\n\\n\\n\\n\\n\\nMy wife and I are taking her mother on a (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103428150\\', \\'\\');}, \\'log_autolink_impression\\');cruise to New York in November to celebrate her 90th birthday. We will be staying in New York for 2 nights [3 days] after the cruise.\\n\\n\\n\\n\\n\\n\\n\\nMother needs a wheelchair to get about as she has limited mobility, she can only manage a few stairs as well.\\n\\n\\n\\n\\n\\n\\n\\nHow wheelchair friendly is New York? \\n\\n\\n\\n\\n\\n\\n\\nWe would want to show her as many of NY's attractions as possible, can you recommend which ones would be accessible to her? Hoe best to see NY in her wheelchair?\\n\\n\\n\\n\\n\\n\\n\\nAre restaurants wheelchair friendly?\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nGrateful for any advice\\n",
            "date": "17 Oct 2019, 4:17 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nI took my mum (also uses a wheelchair) to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103428233\\', \\'\\');}, \\'log_autolink_impression\\');New York a couple of years ago. Short of the subway (best avoided) it was a fairly simple (and very enjoyable) experience. Every bus was accessible, and we didn't have any problems hailing a cab. \\n\\n\\n\\nAll the major attractions were accessible, and no problems at all with any of the restaurants we wanted to visit. \\n\\n\\n\\nThe subway was a bit messy because, while the 'starting' station might have had a lift/elevator, the destination one might not (or was out of service). That said, the buses were excellent.\\n",
                    "date": "17 Oct 2019, 4:25 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nWhich attractions?\\n\\n\\n\\nMost are accessible.\\n\\nQuite a few are not.\\n",
                    "date": "17 Oct 2019, 4:45 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nThe larger museums are fairly good and may even offer wheelchairs for use within the building. As mentioned, the subway generally is not accessible and the elevators notorious for being broken. Buses, on the other hand, are excellent, but take longer.\\n",
                    "date": "17 Oct 2019, 5:19 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nHere is the official city tourist bureau accessibility guide: http://www.nycgo.com/accessibility\\n\\n\\n\\nSUBWAY - Unfortunately only a few stations have elevators. The stations marked with a wheelchair symbol on the map have elevators: http://web.mta.info/maps/submap.html Be aware that due to retrofitting challenges some stations do not have elevators that serve all platforms (zoom in to the fine print on the map for details) \\n\\nHere's info on the accessible stations web.mta.info/accessibility/stations.htm\\n\\nAnd you can check here each day for possible elevator outages or repair work: http://advisory.mtanyct.info/EEoutage/\\n\\nCITY BUSES - While slower, they can be useful - all buses are wheelchair accessible and there is a very extensive route network. Manhattan Bus map: http://web.mta.info/nyct/maps/manbus.pdf \\n\\nCABS This is a way to call fully wheelchair accessible cab to you anywhere within the city: http://www.accessibledispatch.com/ (The cost to you is the same as any yellow cab. The cab dispatcher at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103429268\\', \\'\\');}, \\'log_autolink_impression\\');JFK or LGA can also get one, but not at Newark airport in New Jersey.) If she can transfer and you can fold the chair and stash in the trunk a regular cab or car service can also serve.\\n\\nTHEATER - Most Broadway shows offer wheelchair locations (or transfer arm seats), sometimes at a substantial discount for the chair user and a companion seat\\n\\nMost sidewalks have decent curb cuts and there are only a few locations where there are cobblestone streets or rough sidewalks.\\n\\nNearly everyplace will have the ADA (Americans with Disabilities Act) arrangements. A few historical buildings are exempt. Accessible entrances may be adjacent to main entrances - there should be signage with a wheelchair symbol directing you. \\n\\nFinding accessible restaurants is not a problem - but be aware and ask about the restroom access which is sometimes not in some of the smaller places\\n\\nThere are a few places that might be on your itinerary you should buy advance tickets for \\n\\n-Theater tickets for any \"hot\" shows (see wheelchair seat info above)\\n\\n-The Statue Of Liberty / Ellis Island - Ferry & Pedestal Museum are accessible - use only the official ticket seller https://www.statuecruises.com/\\n\\n- Tenement Museum - only the Shop Life tour is wheelchair accessible, they also do good neighborhood tours https://www.tenement.org/vizinfo_ada.php\\nEdited: 17 October 2019, 17:55 ",
                    "date": "17 Oct 2019, 5:52 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nP.S. regarding the SOL/Ellis - there is a new freestanding accessible SOL museum that is included in all Statue (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103429762\\', \\'\\');}, \\'log_autolink_impression\\');Cruises tickets https:/\\xe2\\x80\\xa6 The view from Pedestal terrace requires a few steps. It is unclear at this time what, if anything, remains in the former museum space within the Pedestal\\n\\n The Ellis Island museum is also accessible https:/\\xe2\\x80\\xa6physical-mobility.htm\\n",
                    "date": "17 Oct 2019, 6:31 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nOne potential problem is rest rooms in older restaurants, which are often located downstairs. If planning on eating in one of these i would call and ask about the location of the restroom.\\n",
                    "date": "18 Oct 2019, 12:12 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nHorse and carriage ride around (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103445291\\', \\'\\');}, \\'log_autolink_impression\\');Central Park\\n\\nNight and day sightseeing cruises\\n\\nEmpire State Building\\n\\nBest restaurants near the Rockafella Centre\\n",
                    "date": "18 Oct 2019, 3:43 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nOk thankyou for this, it's something we hadn't thought of, many thanks\\n",
                    "date": "18 Oct 2019, 3:44 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nThank you for your advice and the links\\n",
                    "date": "18 Oct 2019, 3:46 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Wheelchair friendly \\n",
                    "body": "\\n\\n\\n\\nThank you so much for your comprehensive reply and much advice\\n",
                    "date": "18 Oct 2019, 3:47 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986410-Getting_from_JFK_to_Union_Square-New_York_City_New_York.html",
            "title": "\\nGetting from JFK to Union Square ",
            "body": "\\n\\n\\n\\nI am traveling to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103432217\\', \\'\\');}, \\'log_autolink_impression\\');NYC and staying at a hotel within walking distance from Union Square. I was hoping to get some advice on getting from JFK airport to Union Square. My Moovit app is telling me to take the Jamaica LIRR (Far Rockaway ir Hempstead) to East New York, then ride the L to Union Square. I am wondering if anyone has taken this route before and can give me some advice on what to expect. Is there another recommended way to get to Union Square from JFK? I\\xe2\\x80\\x99m not going to be taking taxis to save on costs. Thanks so much!\\n",
            "date": "17 Oct 2019, 9:18 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nNot even close: If you are staying west of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103432489\\', \\'\\');}, \\'log_autolink_impression\\');Union Square, like 5th or 6th Avenue, do the following:\\n\\nTake the JFK Airtrain shuttle that goes to Jamaica. Take the \"E\" train to \"71st avenue-Forest Hills\", get off and wait for the \"F\" train, take it to 14th St (and 6th Avenue), and there your are.\\n\\nIf you are staying near Broadway (Union Square itself) take that same \"E\" train, get off at \"Queens Plaza\" instead; wait there for the \"R: train and take it to 14th St-Union Square and there you are again.\\n\\nTotal cost will be around $10 per person or less (depending on when the Airtrain fare goes up).\\n\\n\\n\\nSummary: Airtrain to Jamaica, \"E\" to Queens Plaza, \"R\" to Union Square. (a one-hour trip).\\n\\nOne last question: Your hotel may or may not actually be near the stations I mentioned; there are about 5 subway stations within 1/2 mile of Union Square. Where is it really?\\nEdited: 17 October 2019, 21:34 ",
                    "date": "17 Oct 2019, 9:32 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nThe way the OP described will actually work, but will be more expensive and probably slower than just taking either of the subway directions in post #1.\\n",
                    "date": "17 Oct 2019, 9:35 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nWhat one has to do when looking up transport directions is look not at what they say if you leave right this mjnute, but what is mentioned over the next hour; then you see a pattern, this (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103432797\\', \\'\\');}, \\'log_autolink_impression\\');Long Island RR trip occurs every half hour, and is expensive; the huge number of subway ways that leave starting one minute later are a lot more frequent, require fewer transfer, cost less, and take the same amount of time.\\n\\nThey don't even make clear that many Long Island RR train stopping at Jamaica go to East New York, not just the one coming from Far Rockaway, but in the next 30 seconds, that't the one showing up. Any Brooklyn train would be a correct train. But their whole trip is a bad choice.\\n\\nTake the E train to the R and you will be fine and they both run every 5-8 minutes.\\n",
                    "date": "17 Oct 2019, 9:54 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nThank you for sharing this!\\n",
                    "date": "17 Oct 2019, 10:13 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nThank you so much! Really helpful!\\nEdited: 17 October 2019, 22:14 ",
                    "date": "17 Oct 2019, 10:13 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nI am staying at Moxy (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103433256\\', \\'\\');}, \\'log_autolink_impression\\');NYC East Village. (112 East 11th Street).\\n",
                    "date": "17 Oct 2019, 10:22 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nSo it's the E to the R at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103433775\\', \\'\\');}, \\'log_autolink_impression\\');Queens Plaza. When you leave the subway (near the front of the train) just find your way to 14th St, look for 4th Avenue and walk down 4th Avenue to 11th St and turn left. It's mostly a grid, so you will become accustomed to it quickly.\\n",
                    "date": "17 Oct 2019, 11:00 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nIf you are going to take the subway with luggage, I recommend taking as light luggage, in as few pieces, as possible. You will probably have to take it up stairs -- 20 to 40 -- because only 20% of the subway stations have elevators or escalators. And the elevators or escalators that do exist are frequently not in service.\\n",
                    "date": "17 Oct 2019, 11:35 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nLuckily, (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103434414\\', \\'\\');}, \\'log_autolink_impression\\');Jamaica has elevators, 14th St Union Square on the R train has elevators, and there is no change of levels at Queens Plaza. So you can get there nice and easily.\\n",
                    "date": "17 Oct 2019, 11:47 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Getting from JFK to Union Square \\n",
                    "body": "\\n\\n\\n\\nIt will be fine if all of the elevators are working....\\n",
                    "date": "17 Oct 2019, 11:49 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988259-Lotte_vs_warwick-New_York_City_New_York.html",
            "title": "\\nLotte vs warwick ",
            "body": "\\n\\n\\n\\nI\\xe2\\x80\\x99ve always had the idea of go big or go home. I am taking my mom to nyc for her dream of always wanting to visit at Christmas to see (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103449744\\', \\'\\');}, \\'log_autolink_impression\\');Rockefeller all lit up and the rockettes . My struggle is which hotel? I like that they are both close to Rockefeller and Christmas activities. My issue is the Lotte is almost $1k more than the Warwick. That extra can go a long ways for food and drinks while we are there, but the Lotte seems so much more luxurious. Does it really make sense to spend the $1k on a room? I appreciate everyone\\xe2\\x80\\x99s thoughts and suggestions!\\n",
            "date": "18 Oct 2019, 9:46 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nIt all depends on whether or not you can afford to spare that $1K, Only you can determine that,. It will be more of a \"Christmas feel\" at the Lotte.\\n\\nIf you can still eat where you plan to, shop what you want, and this is a \"once in a life time\" for your mom..........\\n",
                    "date": "18 Oct 2019, 9:57 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nThe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103450181\\', \\'\\');}, \\'log_autolink_impression\\');Lotte is known to be over-the-top with its Christmas decorations. It can be a bit garish, but celebratory it certainly is. I agree with WEQueen. If it is a once-in-a-lifetime experience for your mom and you can truly afford it, I would go for it.\\n\\nYou don't say how long you're going for, and some will disagree with me, but another thing you could do is schedule the Warwick for the first part of the trip, then finish at the Lotte. You don't even have to call a cab to get from one to the other -- they're that close that you can walk.\\nEdited: 18 October 2019, 22:19 ",
                    "date": "18 Oct 2019, 10:18 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nI didn't know that the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103453008\\', \\'\\');}, \\'log_autolink_impression\\');Lotte has garish Christmas decorations that are over the top? I would say opulent.\\n\\n\\n\\nThese pictures don't show it as garish, but it depends on personal taste: https://tinyurl.com/yyyrarq9\\n\\n\\n\\nI would choose the Lotte for a better hotel overall, though the extra $1000 could be used elsewhere for sure.\\n",
                    "date": "19 Oct 2019, 2:07 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nAynat, have you ever been there inside during Christmas? I think you would understand my comments better.\\n",
                    "date": "19 Oct 2019, 5:33 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nI think it's a very personal decision and you know your mother's preferences/dreams best, but on the topic of garish, I think there are few structures in Manhattan more garish (except maybe (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455279\\', \\'\\');}, \\'log_autolink_impression\\');Trump Tower, which is roughly the same vintage) than the hotel often known as the Palace. Keep in mind that the old structures they use in their promos -- the Villard houses -- are still there and incorporated as part of the hotel only because the hotel's builders (the late ogre Harry Helmsley and his tyrannical ogress wife Leona, a couple locals often put in the same category of repulsiveness as Donald Trump) were forced to save them by the local landmark preservation authorities. Their original intent was to tear them down. But what was built on top of them is awful 1980s Vegas style architecture.\\n\\n\\n\\nI have never been beyond the ground floor of either hotel, so I cannot comment on the rooms. If your mother wants to be close to Rock Center, the Palace is closer (though the Warwick certainly isn't far), but keep in mind E 50th St. is very crowded at Christmas, and when I walk by the Palace entrance in the evening I often see long lines of people waiting for taxis. Don't know if that would be an issue for you. The Warwick looks fine to me, and I like hotels of that vintage, but have no idea what the rooms are like. Although the area where it is will also be crowded, it's just far enough away from Rock Center to appeal to me, as I hate crowds. But you have to decide based on your and your mother's preferences.\\n",
                    "date": "19 Oct 2019, 6:36 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nYes, I have, Lizzie. \\n\\n\\n\\nIt was decorated \"opulently\", nothing like (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455515\\', \\'\\');}, \\'log_autolink_impression\\');Rolf's which is what I would say is garish.\\n",
                    "date": "19 Oct 2019, 7:10 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nI\\xe2\\x80\\x99d go with (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103457933\\', \\'\\');}, \\'log_autolink_impression\\');Lotte\\n",
                    "date": "19 Oct 2019, 11:07 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nGo big or go home!! Says it all, so go BIG treat your Mum to her dream. Book the Lotte\\n",
                    "date": "19 Oct 2019, 12:43 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nI think (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103463170\\', \\'\\');}, \\'log_autolink_impression\\');Rolf's is beyond garish. It's ridiculous! But that's part of the fun.\\n",
                    "date": "19 Oct 2019, 6:55 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Lotte vs warwick \\n",
                    "body": "\\n\\n\\n\\nI don't think the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468003\\', \\'\\');}, \\'log_autolink_impression\\');Lotte is worth $1000 more (over how many nights?) BUT the Warwick is not a \\xe2\\x80\\x9cgo big..\\xe2\\x80\\x9d kind of place. But there are likely a dozen options in between those prices. First, I suggest calling Magellan Hotels and see if they have a better price.\\n\\n(844) 652-5149\\n\\nI'd also consider the Omni Berkshire, the Intercontinental Barclay and the Quin.\\n\\n\\n\\nHow old is your Mom? Where do you and she live? How much time do you anticipate you'll stay in the hotel?\\n",
                    "date": "20 Oct 2019, 1:39 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12990321-Typical_american_dining-New_York_City_New_York.html",
            "title": "\\ntypical american dining ",
            "body": "\\n\\n\\n\\nhi,were staying at the sheraton hotel in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103467775\\', \\'\\');}, \\'log_autolink_impression\\');Tribeca in November, 1st time in NY and would like to go out and sample typical local new york dining, breakfast,lunch,dinner somewhere the locals would call into when they are out and about? and when we've done the tourist bit, somewhere nice locally for a drink at night.\\n\\n\\n\\n thanks all\\n",
            "date": "20 Oct 2019, 1:18 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nIn (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103467817\\', \\'\\');}, \\'log_autolink_impression\\');Tribeca you don\\xe2\\x80\\x99t have to look far, the Odeon on West Broadway is one of our favorites, and has everything you\\xe2\\x80\\x99re looking for! \\n\\nhttps://www.theodeonrestaurant.com/\\n",
                    "date": "20 Oct 2019, 1:22 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nYou're in a great area for dining. Lots of options within walking distance of your hotel - so a good pick from that perspective. \\n\\n\\n\\nThe great thing about the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103467871\\', \\'\\');}, \\'log_autolink_impression\\');New York City restaurant 'scene' is the chance to eat pretty much anything you'd like, I'd say picking cuisines and types of food that you like would be key. \\n\\n\\n\\nSome of my favourites in the area (mind you, I'm merely a tourist and not a local though I tend to focus on food when traveling): \\n\\n\\n\\nBreakfast\\n\\nSquare Diner\\n\\nTiny's and the Bar Upstairs\\n\\nGee Whiz \\n\\nMaison Kayser\\n\\nTribeca's Kitchen\\n\\nSarabeth's\\n\\n\\n\\nDinner \\n\\n\\n\\nLocanda Verde is great for both breakfast and dinner. \\n\\n\\n\\nFrenchette has a good team of chefs / owners. French bistro type of place\\n\\n\\n\\nGiginio's Trattoria (Italian)\\n\\nAtera (pricier, 2*, you sit at the counter while they prepare the food, tasting menu)\\n\\nTamarind - Indian\\n\\nThe Odeon\\n\\nMarc Forgione\\n\\nKhe-Yo\\n\\nNish Nush for quick, take away falafel\\n",
                    "date": "20 Oct 2019, 1:27 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nThe thing about \"typical\" American dining has to be that it's \"a-typical.\" There are so many influences on our cooking, coming from such a diversity of places in the world, that I really don't think you can point to many things that are \"typical.\"\\n\\nIn NYC we love Mexican, Italian, French, Chinese, Japanese, Korean, Greek, Turkish, Indian, and so many other kinds of foods, from so many different regions, it's mind-boggling. \\n\\nIn the old days you might have said burgers and fries and milkshakes. (Many would be horrified at that suggestion.)\\n\\nIn (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468098\\', \\'\\');}, \\'log_autolink_impression\\');New York, bagels, pastrami on rye, some would say cheesecake. (Personally I hate pastrami and have eaten cheesecake maybe four times in my life.)\\n\\nPizza. Spaghetti and other pastas. \\n\\nSalmon and scallops, sole and shrimp. \\n\\nSalads. All kinds of salads and greens and fruits. Sandwiches. Soup. Ice cream. Cupcakes and cookies.\\n\\n\\n\\nOne of the best things about New York is that you can find cuisine from pretty much anywhere. Go to many neighborhoods and you might as well be in a foreign country.\\n\\n\\n\\nOne of the DEs for New York, Linda E from Brooklyn, has one of the most experienced palates on the Board. She can suggest loads of different types of foods.\\n\\n\\n\\nYou might want to check out a food tour with blogger Ziggy, a regular contributor on the board -- www.eatingwithZiggy.com.\\n",
                    "date": "20 Oct 2019, 1:49 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nFor me, typical American dining is diner food as long as the diner's chef is not based on a cuisine like Greek food (there's a lot of Greek diners.) It's not fine dining but it is what a typical American would go for if they just wanted some good food at a reasonable price.\\nEdited: today, 01:54 ",
                    "date": "20 Oct 2019, 1:53 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nIn (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468239\\', \\'\\');}, \\'log_autolink_impression\\');TriBeCa? So many options. In addition to the ones above, I like Tutto Il Giorno, Vin Sur and Vingt Wine Bar. Augustine is not far away. Neither is SoHo and some of my favorites are Shuka and Coco Pazzo. And Raoul\\xe2\\x80\\x99s, a long time neighborhood staple. And Blue Ribbon Brasserie and The Dutch.\\n",
                    "date": "20 Oct 2019, 2:02 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nThat should have been Vin Sur Vingt.\\n",
                    "date": "20 Oct 2019, 2:13 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nIn (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468410\\', \\'\\');}, \\'log_autolink_impression\\');New York \"typical dining\" is just about any ethnicity that you can think of. When DH and I go out we very rarely do steak - or even \"american\" places - much more likely to do Italian, French, indian, chinese, all sorts of other asian places. Some of our favorites are peruvian, ethiopian, thai, polish, real jewish deli, and anything else you can think of. \\n\\n\\n\\nYou can of course spring the big bucks for a steak house or head to a pub for a burger - but NYC has so many different types of places to eat - exploring new things is a big part of visiting the city.\\n",
                    "date": "20 Oct 2019, 2:15 AM"
                },
                {
                    "title": "\\n8.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nWe've stayed at that hotel more than a dozen times. SO well located for the subway to the rest of the city!\\n\\n\\n\\nFor drinks, we like the dive bar \"Nancy Whiskey\", just around the corner. Between Nancy Whiskey and the hotel is one of our favorite Italian restaurants, Pepolino/\\n\\n\\n\\nFor lunch we usually go to Chinatown, which is about a 10 minute walk to the east. So many great options there.\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103468735\\', \\'\\');}, \\'log_autolink_impression\\');Odeon is good, we also like the Square Diner, which is a real throwback. Sarabeth's is great, too, for more of an upscale option\\n\\n\\n\\nOf other things mentioned above, we really liked Tiny's, Marc Forgione and Locanda Verde, too.\\n\\n\\n\\nMake sure you take a walk along the Hudson River, too, it's a short walk from the hotel!\\n",
                    "date": "20 Oct 2019, 2:51 AM"
                },
                {
                    "title": "\\n9.\\n\\nRe: typical american dining \\n",
                    "body": "\\n\\n\\n\\nAgree\\xe2\\x80\\x94-typical American is usually ethnic food. We are the great melting pot and it\\xe2\\x80\\x99s sushi one day, Italian, Indian food the next, hot pot, Korean, you name it. \\n\\n\\n\\nYes diner food is a staple but even then you\\xe2\\x80\\x99ll find ethnic traces. Yes, lots of Greek owned diners here. Where I grew up in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103471292\\', \\'\\');}, \\'log_autolink_impression\\');Boston, there were lots of Irish diners. You can find Asian-owned diners here too. They all serve up the same core items of eggs and bacon and pancakes but you\\xe2\\x80\\x99ll often see little hints of who owns the place in some selections. \\n\\n\\n\\nIf you go to the \\xe2\\x80\\x9cheartland\\xe2\\x80\\x9d of America, you\\xe2\\x80\\x99ll find maybe less spicy \\xe2\\x80\\x9cethnic\\xe2\\x80\\x9d choices than on either coast but even there you\\xe2\\x80\\x99ll see traces of the immigrant groups that settled there. In northern Michigan there\\xe2\\x80\\x99s a lot of German food, for example. \\n\\n\\n\\nIf you have something specific in mind, you\\xe2\\x80\\x99ll probably find a version of it in NYC. If you want southern US food, look for soul food places up in Harlem. Diner food is everywhere.\\nEdited: today, 08:13 ",
                    "date": "20 Oct 2019, 8:12 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12988813-Airport_Transportation-New_York_City_New_York.html",
            "title": "\\nAirport Transportation ",
            "body": "\\n\\n\\n\\nArriving at La Guardia around 1 PM on a weekday. What is the best mode of transportation from airport to hotel in Manhattan (3 adults, 6 pieces of luggage-going onto Canada for Christmas so we won't be traveling too light). Would taxi, Uber, Lyft, or private transportation be best? Not interested in public modes i.e. subway, buses, etc. Thank you!\\n",
            "date": "19 Oct 2019, 4:41 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Airport Transportation \\n",
                    "body": "\\n\\n\\n\\nTaxi will suit you. From the official line only. Ignore any offers you receive en route.\\n",
                    "date": "19 Oct 2019, 4:51 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Airport Transportation \\n",
                    "body": "\\n\\n\\n\\nJust to add to the good cautionary note from Northern Traveler. We've seen notes where people have been talked out of staying in the line by hucksters. The official dispatcher is in uniform at the far end of the taxi line.\\n",
                    "date": "19 Oct 2019, 6:55 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Airport Transportation \\n",
                    "body": "\\n\\n\\n\\nThe last I saw the taxi area at LG is aay from the terminal and requires a bus. I would instead do an Uber or (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103455787\\', \\'\\');}, \\'log_autolink_impression\\');car service like Dial 7 - the area for which is right across from the terminal and easier to get to hauling so much luggage around. Be sure to tell whichever how many pieces of luggage and how large so you get a vehicle large enough.\\n",
                    "date": "19 Oct 2019, 7:51 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Airport Transportation \\n",
                    "body": "\\n\\n\\n\\nOur recommendation: try to switch airports; we will avoid (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103456061\\', \\'\\');}, \\'log_autolink_impression\\');LGA with a passion at least until the construction is completed.\\n\\n\\n\\nCH\\n",
                    "date": "19 Oct 2019, 8:37 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Airport Transportation \\n",
                    "body": "\\n\\n\\n\\nThank you for the great recommendations. We are booked on Southwest and they will no longer be flying into/out of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103459106\\', \\'\\');}, \\'log_autolink_impression\\');EWR as of November 2019 due to the problems with the max planes. That leaves La Guardia if we want to keep our current reservation.\\n",
                    "date": "19 Oct 2019, 11:36 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Airport Transportation \\n",
                    "body": "\\n\\n\\n\\nWe always arrange for pickup at (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103460190\\', \\'\\');}, \\'log_autolink_impression\\');LGA from Carmel Limo: www.carmelLimo.com\\n\\nWe have been using them for years. Dependable, and no surge pricing (as is done often by Uber). When you make a reservation on their website, you give them your flight info & they track your plane. When you land at LGA you get a text message welcoming you to NYC & telling you to let them know when you have your luggage and are ready to go. Once ready to go, you click on link in their app and they text you back with car/driver details and specific pick-up location. Very easy. No need to pay in advance, Your choice if you want to pay at end of ride with cash or credit card.\\nEdited: yesterday, 13:20 ",
                    "date": "19 Oct 2019, 1:19 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12943017-Thanksgiving_2019_in_NYC_What_to_Do_Where_to_Eat-New_York_City_New_York.html",
            "title": "\\nThanksgiving 2019 in NYC: What to Do & Where to Eat ",
            "body": "\\n\\n\\n\\nThanksgiving is always the fourth Thursday in November. This year it is Thursday, November 28, 2019.\\n\\n\\n\\nThanksgiving is one of the biggest holidays in the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103071641\\', \\'\\');}, \\'log_autolink_impression\\');United States...it's non-religious and most people celebrate it. As a result, many shops, museums, etc. will be closed, but there's still plenty you can do to fill the day!\\n\\n\\n\\nFirst of all, in the morning there is the Macy's Thanksgiving Day Parade. Here is more information, including a map of parade route and viewing tips:\\n\\n\\n\\nhttps://www.macys.com/social/parade/\\n\\n\\n\\nhttps://www.nyctourist.com/macys_map.htm\\n\\n\\n\\nAnd here is a thread with reports from people on the forum who\\xe2\\x80\\x99ve gone to the parade:\\n\\n\\n\\nhttps://www.tripadvisor.com/ShowTopic-g60763\\xe2\\x80\\xa6\\n\\n\\n\\nOn Wednesday evening the 27th (the night before Thanksgiving) the parade's character balloons will be inflated all around the American Museum of Natural History (AMNH). In recent years, the inflation has begun at 1 pm and ended at 8 pm. The entrance to the loop is on Columbus Avenue at 74th Street, and there is a security checkpoint before entering. The loop ends on Central Park West at 81st Street.\\n\\n\\n\\nHere is a report from a visit to the balloon inflation last year:\\n\\n\\n\\nhttps://www.tripadvisor.com.au/ShowTopic-g60\\xe2\\x80\\xa6\\n\\n\\n\\nSince it\\xe2\\x80\\x99s often asked, here\\xe2\\x80\\x99s a list of hotels with parade view rooms:\\n\\n\\n\\nhttps://mommypoppins.com/new-york-city-kids/\\xe2\\x80\\xa6\\n\\n\\n\\nOn Thanksgiving Day, in addition to the parade, some of the other places and things you can do and see include:\\n\\n\\n\\nVisit one of the observatories (Top of the Rock, Empire State Building, One World) \\xe2\\x80\\x94 Take the Statue Cruises ferry to the Statue of Liberty and Ellis Island \\xe2\\x80\\x94 Ride the Staten Island ferry \\xe2\\x80\\x94 See the Radio City Christmas Spectacular (the Rockettes show) \\xe2\\x80\\x94 Walk through Central Park \\xe2\\x80\\x94 Visit the Central Park Zoo \\xe2\\x80\\x94 Walk over the Brooklyn Bridge \\xe2\\x80\\x94 View the Christmas window displays in Midtown (see below for the \\xe2\\x80\\x9cChristmastime in NYC 2019\" thread, which includes a walk) \\xe2\\x80\\x94 Wander through neighborhoods with charming architecture (ex: Greenwich Village or Brooklyn Heights)\\n\\n\\n\\nHere is this year's Christmastime in NYC thread with a list of many of the seasonal attractions:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6103071495\\n\\n\\n\\n\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\xe2\\x80\\xa2\\n\\n\\n\\nThanksgiving is a big family holiday focused around the traditional meal of turkey and all the trimmings. Here in NYC it's not uncommon to eat this special meal out, and many restaurants will be serving that day.\\n\\n\\n\\nMost restaurants only make reservations a month in advance, even for Thanksgiving. Most restaurants take reservations using OpenTable and/or Resy:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6new-york-city-restaurants\\n\\n\\n\\nhttps://resy.com/\\n\\n\\n\\nHere are some lists from last year with Thanksgiving restaurant recommendations:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6best-thanksgiving-restaurants-nyc\\n\\n\\n\\ngrubstreet.com/2018/11/thanksgiving-2018-res\\xe2\\x80\\xa6\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nhttps://mommypoppins.com/new-york-city-kids/\\xe2\\x80\\xa6\\n\\n\\n\\nThe new recommendations for 2019 won\\xe2\\x80\\x99t come out until much closer to Thanksgiving, but these are still a good guide!\\n\\n\\n\\nEnjoy spending Thanksgiving in NYC! :)\\n",
            "date": "27 Sep 2019, 10:37 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nRegarding the recommendation lists linked above:\\n\\n\\n\\nI think the published lists of recommendations include some really good options, both restaurants that I personally like and restaurants that I know are generally well-regarded. But they also include some places that I myself would never choose...\\n\\n\\n\\nThe lists are a starting point, they help to narrow the field -- choose the places in your price range (and/or in your desired location) and then look up the menus, check out photos to get a feel for the decor/ambience/vibe, look at reviews, etc. It comes down to individual preferences!\\n\\n\\n\\nI'll also caution that none of our personal recommendations should be taken as \"the word\". People have different tastes and what one of us loves you may hate. Just like with the restaurants on the lists, you should do your research on the personally recommended restaurants - in the end you have to choose a place that's right for YOU! :)\\n\\n\\n\\nAs a visitor to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103071678\\', \\'\\');}, \\'log_autolink_impression\\');NYC, you might find one of these options particularly festive:\\n\\n\\n\\nThe Rock Center Cafe and its sister restaurant the Sea Grill both look out to the Rockefeller Center ice skating rink. (The tree there will be in position on Thanksgiving Day but will be covered in scaffolding). These two restaurants are already taking reservations, so if you're interested you should book now.\\n\\n\\n\\nThe Bryant Park Grill is directly in Bryant Park, where the holiday market and ice skating rink will already be in full swing on Thanksgiving. (The tree may be up by then, too, although it might not be lit yet). \\n\\nThe River Cafe in Broolyn will also be serving on Thanksgiving Day - it has panoramic skyline views of Manhattan and a Michelin star. \\n\\n\\n\\nManhatta (in the Financial District) was open on Thanksgiving last year \\xe2\\x80\\x94 on a high floor, beautiful views\\n\\n\\n\\nThe Loeb Boathouse is nestled in the middle of Central Park and has served a special Thanksgiving meal in the past; hopefully this year, too!\\n\\n\\n\\nEnjoy!\\n",
                    "date": "27 Sep 2019, 10:39 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nBump - this had already reached the 3rd page of threads!\\n\\n\\n\\nWell done - as usual - Frangipani.\\n",
                    "date": "28 Sep 2019, 5:29 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nFor 20+ years we were among the 80 makeup artists that paint the faces on the 700-800 clowns that annually walk in the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103076717\\', \\'\\');}, \\'log_autolink_impression\\');Macy\\xe2\\x80\\x99s parade. (And if you have an aptitude for make-up or art, contact Macy\\xe2\\x80\\x99s for this GREAT opportunity! The artists also have first dibs on being IN the Macy's Parade if additional clowns or balloon handlers are needed.) We churned them out between 5AM - 8 AM at the New Yorker Hotel and at that point they are bussed uptown to the start of the parade. In past years we have either gone to the starting point with them (it is a hoot there standing with the on-lookers and can be crowded, but so is the rest of the route); or we have gone to stand with the camera crews in front of Macy\\xe2\\x80\\x99s to watch the professional acts (many are from Broadway shows). But, ultimately, we found that the best views of the parade, floats, balloons and the professional performers are at home on the couch in front of the TV.\\n\\n\\n\\nIf you are watching the parade along the route, you are likely to miss the professional acts in front of Macy\\xe2\\x80\\x99s. And if you are lucky enough to get a seat or standing room in front of Macy\\xe2\\x80\\x99s, you lose the perspective of the crowds. And in either case, you are likely to be cold and/or wet as it often rains on Thanksgiving Day. The TV gives a superior prospective on the entire event and is much more comfortable.\\n\\n\\n\\nBottom line: If you LOVE crowds and MUST have the experience of the parade, then go. We recommend standing along Central Park West a few blocks south (below) of the line-up on the west side of the avenue. Stay away from the Times Square area and the area around Macy\\xe2\\x80\\x99s. It will get VERY crowded in those locations. In any case, start the adventure with an empty bladder!\\n\\n\\n\\nOtherwise, sleep late and watch the parade on TV with a cup of coffee or tea or hot chocolate.\\n\\n\\n\\nAll that said, if you really want to treat yourself to a great experience the night BEFORE the Parade, go to Central Park West between 77th & 81st Streets to watch the huge balloon cartoon characters being inflated.\\n\\n\\n\\nCH\\n",
                    "date": "28 Sep 2019, 6:00 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nOh, and for a truly great Thanksgiving meal we highly the (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103076741\\', \\'\\');}, \\'log_autolink_impression\\');Friend of a Farmer restaurant on Irving Place a few blocks south of Gramercy Park (the largest private park in the City). For more information see:\\n\\n\\n\\nhttps://www.friendofafarmer.com/menus\\n\\n\\n\\nCH\\n",
                    "date": "28 Sep 2019, 6:04 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nThanks CH for adding your opinions. I think many visitors do have wonderful experiences at the parade, as evidenced by the link in the opening post where they tell their tales. As long as you research in advance and have a game plan, it can be a lot of fun!\\n\\n\\n\\nThe balloon inflation is around AMNH but it is not on (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103083530\\', \\'\\');}, \\'log_autolink_impression\\');Central Park West and, to avoid huge crowds, it\\xe2\\x80\\x99s better to go on Wednesday afternoon vs Wednesday evening. The correct information is in my opening post, along with a link to forum DE Anyat\\xe2\\x80\\x99s thread telling of her experience last year. \\n\\n\\n\\nPoster LizzieandIzzie also recommends the Thanksgiving meal at Friend of a Farmer, but always cautions to stick with the turkey and avoid the fish. I\\xe2\\x80\\x99ve never been to FOAF on Thanksgiving, but tried their regular menu a few times and was unimpressed. Just my personal opinion, though, and, as I say in my first reply, we all have different tastes!\\n",
                    "date": "28 Sep 2019, 4:01 PM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nGreat post.\\n\\nThanks!\\n",
                    "date": "28 Sep 2019, 4:39 PM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\n-:- Message from TripAdvisor staff -:-TripAdvisor staff removed this post because it did not meet TripAdvisor\\'s forum posting guidelines with prohibiting self-promotional advertising or solicitation.We ask all of our members to keep their forum messages free of self-promoting advertisements or solicitation of any kind - members affiliated with any tourism-related business should not include commercial contact information or URLs in their forum messages.To review the TripAdvisor Forums Posting Guidelines, please follow this link: http://www.tripadvisor.com/pages/forums_posting_guidelines.htmlWe remove posts that do not follow our posting guidelines, and we reserve the right to remove any post for any reason.Removed on: 30 September 2019, 18:31\\n",
                    "date": "28 Sep 2019, 10:28 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nWe booked Friends of a farmer couple of weeks ago for thanksgiving. Had to phone to book.\\n",
                    "date": "28 Sep 2019, 11:12 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nHi again frangi and thank you for another wonderful thread. \\n\\n\\n\\nI think your points in Post 1 about finding the restaurant for that all-important Thanksgiving meal are spot-on and so important. It is all about making the choice your own, and what makes giving recommendations so tricky. If you feel like getting the meal right is really important, you need to dig in and do that research.\\n\\n\\n\\nI found the special Thanksgiving listing on OpenTable a huge help as a starting resource, helping me narrow down budget and style of cuisine and such to begin. A lot of places will publish or have links to their menus there as well.\\n\\n\\n\\nAs for the parade vs. balloon inflation question, I have done both, and would not give up the cold and the crowds of the parade for anything. The balloon inflation was fun (and we had excellent company! \\xf0\\x9f\\x98\\x8a) but the parade was mind-blowing excitement. The combined effect of the floats, the marching bands, the anticipation and good cheer of the spectators, and yes, the balloons, made for a thrilling spectacle that I loved being a part of.\\n\\n\\n\\nMy thoughts are if you as a visitor, are so interested to watch a parade that you would turn it on and watch it on TV in your hotel room, and that hotel room is actually in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103103534\\', \\'\\');}, \\'log_autolink_impression\\');New York City, why on earth would you not step out your door and see the real thing?? (Of course, not talking about those physically unable, or deathly anxious around crowds, etc.) But my advice, if you are up to it, and if you are debating it, go for it! \\n\\n\\n\\nWe watched, as CasaHoffa suggests in Post 3, from Central Park West a few blocks south from the start. We had a great vantage point, crowds weren't too bad, and my thoughts were that all the participants would be at their freshest, timing wouldn't be bogged down, and we would be out of there earlier than if we watched further along the route. We also ducked out before the end of the parade and beat the rush out of there. \\n\\n\\n\\nHappy planning for you lucky ones! Thanks again for the post, frangi! \\xf0\\x9f\\x98\\x80 \\xf0\\x9f\\xa6\\x83\\n",
                    "date": "29 Sep 2019, 8:18 PM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Thanksgiving 2019 in NYC: What to Do & Where to Eat \\n",
                    "body": "\\n\\n\\n\\nThis is a couple of years old but might interest\\n\\n\\n\\nhttps://www.tripadvisor.com/ShowTopic-g60763\\xe2\\x80\\xa6\\n",
                    "date": "7 Oct 2019, 9:42 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12943001-Christmas_2019_Trees_Decorations_Markets_Ice_Skating_MORE-New_York_City_New_York.html",
            "title": "\\nChristmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! ",
            "body": "\\n\\n\\n\\nThe Christmas season officially starts after Thanksgiving, which in 2019 is on the latest possible date \\xe2\\x80\\x94 Thursday, November 28th. Holiday decorations and displays, including the department store windows and indoor Christmas trees, are typically up up by Thanksgiving Day. Outdoor tree lightings will happen the week after Thanksgiving (the first week of December). Ice skating rinks open in October, and the holiday markets open between between Halloween and early December. Most holiday performances and shows begin in November. \\n\\n\\n\\nI have confirmed as many dates as I can below, but not everything has been announced yet. I\\xe2\\x80\\x99ll update the thread as dates become known, plus I\\xe2\\x80\\x99m providing links to websites where dates can be checked. \\n\\n\\n\\nPlease continue to add to this thread with other Christmastime in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103071474\\', \\'\\');}, \\'log_autolink_impression\\');NYC festivities! :)\\n\\n\\n\\n**CHRISTMAS TREES**\\n\\n\\n\\nAmerican Museum of Natural History (origami tree) \\xe2\\x80\\x93 Monday, November 25th through Sunday, January 12, 2020\\n\\n\\n\\nMetropolitan Museum of Art (baroque tree) \\xe2\\x80\\x93 Tuesday, November 26th through Sunday, January 5, 2020 \\n\\n\\n\\nLincoln Center \\xe2\\x80\\x93 a tree lighting kicks off the Winter\\xe2\\x80\\x99s Eve celebration on the evening of Monday, December 2nd, and then the tree remains lit for the holiday season:\\n\\n\\n\\nhttp://www.winterseve.nyc\\n\\n\\n\\nRockefeller Center \\xe2\\x80\\x93 the tree lighting ceremony is on Wednesday, December 4th; the tree will remain lit daily from 5:30 am to 11:30 pm into early January \\xe2\\x80\\x94 no end date given yet, keep checking the website:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nBryant Park - the tree lighting \\xe2\\x80\\x9cskate-tacular\\xe2\\x80\\x9d should be in the first week of December, and then the tree remains lit for the holiday season. No date has been confirmed yet, keep checking the website:\\n\\n\\n\\nbryantpark.org/programs/tree-lighting-skate-\\xe2\\x80\\xa6\\n\\n\\n\\nThere will be outdoor Christmas trees in Madison Square Park, Gramercy Park, and Washington Square Park. The tree lighting ceremonies are usually in early December (TBA), but the trees are sometimes lit up even before the ceremony.\\n\\n\\n\\nThere are also nice Christmas trees in the lobby of the main branch of the New York Public Library, in the lobby of the Plaza Hotel, and in the courtyard of the Palace Hotel\\n\\n\\n\\n**HOLIDAY WINDOWS AND DISPLAYS**\\n\\n\\n\\nThe 2019 dates for the windows have not yet been confirmed; I will update the thread as they are announced. All should be unveiled by Thanksgiving Day. \\n\\n\\n\\nIn addition to the department store window displays, lots of shops and buildings are beautifully decorated inside and out, both in Midtown and in more residential neighborhoods. Almost all of the decorations are up by Thanksgiving weekend.\\n\\n\\n\\nThere is a light show on the outside of Saks Fifth Avenue, directly across from Rockefeller Center. First show starts at 4:35 pm, last show is at 11:35 pm, shows start every 10 minutes.\\n\\n\\n\\nThe UNICEF crystal snowflake hangs over the intersection of 5th Avenue and 57th Street.\\n\\n\\n\\nThe Helmsley Building lights up for the holiday season - it sits in the middle of Park Avenue at 46th Street, and the trees in the Park Avenue median for several blocks up from the Helmsley Building are wrapped in Christmas lights.\\n\\n\\n\\nThere is an impressive display of large LED stars in the atrium of the Time Warner Center every year; they pulsate and change colors. \\n\\n\\n\\n**HOLIDAY WALK**\\n\\n\\n\\nMy favorite walk through Midtown at Christmastime:\\n\\n\\n\\n-- Start with the holiday windows at Macy\\xe2\\x80\\x99s, then walk five blocks up Sixth Avenue to Bryant Park \\n\\n-- Stroll the holiday market, get a hot drink and a snack, and sit and watch the ice skaters under the tree\\n\\n-- Walk over to Fifth Avenue and pop into the lobby of the New York Public Library (at 41st Street) to see the lovely Christmas tree. The lions in front of the NYPL building will also be wearing their holiday wreaths \\n\\n-- Keep walking up Fifth Avenue to Rockefeller Center (between 49th and 50th Streets). See the decorations along the Rockefeller Center promenade and look at the tree and ice skating rink \\n\\n-- Watch the light show on the front of Saks Fifth Avenue, then cross Fifth Avenue and look at the Saks holiday windows\\n\\n-- Keep waking up Fifth Avenue to 60th Street, crossing back and forth and enjoying the decorations along the way - these include Cartier, Henri Bendel, Tiffany\\xe2\\x80\\x99s the Unicief snowflake, and Bergdorf Goodman\\n\\n-- Turn right onto 60th Street and walk over to Madison Avenue. View the holiday windows at Barney\\xe2\\x80\\x99s (between 60th and 61st Streets)\\n\\n-- Head east to Lexington Avenue and view the holiday windows at Bloomingdale\\xe2\\x80\\x99s (between 59th and 60th Street)\\n\\n\\n\\nThis walk is best done in the dark, starting no earlier than ~4:30 pm. It\\xe2\\x80\\x99s less crowded if you can go on Monday-Thursday evening. Note the closing time of the NYPL, which can be between 5 pm and 8 pm depending on the day. \\n\\n\\n\\n**HOLIDAY MARKETS**\\n\\n\\n\\nBryant Park \\xe2\\x80\\x93 Thursday, October 31st through Sunday, January 5, 2020\\n\\n\\n\\nGrand Central Terminal \\xe2\\x80\\x93 Monday, November 18th through Tuesday, December 24th\\n\\n\\n\\nUnion Square \\xe2\\x80\\x93 Thursday, November 21st through Tuesday, December 24th \\n\\n\\n\\nColumbus Circle \\xe2\\x80\\x93 Wednesday, December 4th through Tuesday, December 24th \\n\\n\\n\\n**ICE SKATING RINKS**\\n\\n\\n\\nRockefeller Center \\xe2\\x80\\x93 Saturday, October 12th through to April 2020\\n\\n\\n\\nWollman Rink in Central Park \\xe2\\x80\\x93 Monday, October 21st through Sunday, April 5, 2020\\n\\n\\n\\nThe Rink at Bryant Park \\xe2\\x80\\x93 Thursday, October 31st through to March 2020\\n\\n\\n\\n**HOLIDAY PERFORMANCES**\\n\\n\\n\\nThe Rocketttes perform the Christmas Spectacular at Radio City Music Hall from Friday, November 8th through Sunday, January 5, 2020:\\n\\n\\n\\nhttps://www.rockettes.com/christmas/\\n\\n\\n\\nThe NYC Ballet performs the Nutcracker at Lincoln Center from Friday, November 29th through Sunday, January 5, 2020:\\n\\n\\n\\nhttps://www.nycballet.com/ballets/n/george-b\\xe2\\x80\\xa6\\n\\n\\n\\nThe New York Philharmonic at Lincoln Center will conduct holiday concerts in December:\\n\\n\\n\\nhttps://nyphil.org/calendar\\xe2\\x80\\xa6\\n\\n\\n\\nThere will be holiday concerts at Carnegie Hall as well:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6calendar\\n\\n\\n\\nMany churches have Christmas concerts; here are a few of the better-known ones:\\n\\n\\n\\nhttp://www.saintthomaschurch.org\\n\\n\\n\\nhttps://www.trinitywallstreet.org\\n\\n\\n\\nhttps://www.saintpatrickscathedral.org\\n\\n\\n\\nhttp://www.stjohndivine.org\\n\\n\\n\\n**OTHER**\\n\\n\\n\\nSanta will be at Macy\\xe2\\x80\\x99s Herald Square from Friday, November 29th through Monday, December 24th \\xe2\\x80\\x94 advance reservations are required:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6thank-you\\n\\n\\n\\nThe Holiday Train Show at the New York Botanical Garden in the Bronx runs from Saturday, November 23rd through Sunday, January 26, 2020:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nForum feedback on the Christmas themed cruises (cocoa & carols, holiday jazz, etc) on Classic Harbor Line has been positive:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nThe residential neighborhood of DYKER HEIGHTS in Brooklyn is known for its amazing Christmas lights and displays. This bus tour of the Dyker Heights lights has been positively reviewed on the forum:\\n\\n\\n\\nhttps:/\\xe2\\x80\\xa6\\n\\n\\n\\nFree Tours By Foot also offers a Dyker Heights lights tour, plus the site give information for a self-guided tour:\\n\\nfreetoursbyfoot.com/dyker-heights-christmas-\\xe2\\x80\\xa6\\n\\n\\n\\n**CHRISTMAS EVE CAROLING**\\n\\n\\n\\nWashington Square Park \\xe2\\x80\\x93 5 pm on Tuesday, December 24th \\n\\n\\n\\nGramercy Park \\xe2\\x80\\x93 6 pm on Tuesday, December 24th \\n\\n\\n\\nEnjoy the festive season in NYC!\\n",
            "date": "27 Sep 2019, 10:25 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nHere are links for the 2019 Holiday Market websites \\xe2\\x80\\x93 (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103071495\\', \\'\\');}, \\'log_autolink_impression\\');Bryant Park, Union Square, and Columbus Circle are run by Urban Space \\xe2\\x80\\x94 where you can find information on hours:\\n\\n\\n\\nhttp://urbanspacenyc.com\\n\\n\\n\\nhttps://www.grandcentralterminal.com\\n\\n\\n\\n\\n\\nHere are links to the ice skating rink websites, to check for exact opening dates, hours, etc:\\n\\n\\n\\nhttps://therinkatrockcenter.com\\n\\n\\n\\nhttp://www.wollmanskatingrink.com\\n\\n\\n\\nbryantpark.org/amenities/\\xe2\\x80\\xa6overview\\n",
                    "date": "27 Sep 2019, 10:27 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nYou're amazing, frangi!\\n",
                    "date": "27 Sep 2019, 10:32 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nThanks so much for posting this - very helpful\\n",
                    "date": "27 Sep 2019, 11:22 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nBump - already on the second page of threads!\\n",
                    "date": "28 Sep 2019, 5:28 AM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nThankyou! I\\xe2\\x80\\x99ve been waiting for this thread to really start fine tuning our itinerary. I\\xe2\\x80\\x99ve got our walk sorted now with a (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103076541\\', \\'\\');}, \\'log_autolink_impression\\');Bryant park market visit.\\n",
                    "date": "28 Sep 2019, 5:33 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nI visit every year around Thanksgiving, and your posts are always so helpful. Thank you!\\n",
                    "date": "28 Sep 2019, 8:08 AM"
                },
                {
                    "title": "\\n7.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nThanks everyone - always my pleasure! \\xf0\\x9f\\x98\\x8a\\nEdited: 28 September 2019, 15:48 ",
                    "date": "28 Sep 2019, 3:47 PM"
                },
                {
                    "title": "\\n8.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nFantastic, have saved this thread to our December (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103086347\\', \\'\\');}, \\'log_autolink_impression\\');NYC trip!\\n",
                    "date": "28 Sep 2019, 8:10 PM"
                },
                {
                    "title": "\\n9.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nFantastic frangipani7! Finally I can use this!!!\\n\\n\\n\\nThank you! :-)\\n",
                    "date": "29 Sep 2019, 6:49 AM"
                },
                {
                    "title": "\\n10.\\n\\nRe: Christmas 2019: Trees-Decorations-Markets-Ice Skating+MORE! \\n",
                    "body": "\\n\\n\\n\\nYou are amazing, well done.\\n",
                    "date": "29 Sep 2019, 6:51 AM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12991257-Sale_Thanksgiving-New_York_City_New_York.html",
            "title": "\\nSale Thanksgiving ",
            "body": "\\n\\n\\n\\nHello\\n\\n\\n\\nI am in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476373\\', \\'\\');}, \\'log_autolink_impression\\');New Jersey ( & thus NYC) a week before thanksgiving. Since I am there for a week only, which premium outlets should I go to shop where Sale is on? Please advise so that I am able to see handbags, shoes, clothes at one or two places?\\n\\n\\n\\nThanks a zillion!\\n",
            "date": "20 Oct 2019, 3:10 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Sale Thanksgiving \\n",
                    "body": "\\n\\n\\n\\nYou can shop in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476444\\', \\'\\');}, \\'log_autolink_impression\\');NYC at various locations- Department stores, neighborhoods, flea markets, consignment shops, etc.\\n",
                    "date": "20 Oct 2019, 3:16 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Sale Thanksgiving \\n",
                    "body": "\\n\\n\\n\\nThanks - Do outlets in (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103476886\\', \\'\\');}, \\'log_autolink_impression\\');New Jersey have Thanksgiving sales too - Jersey Garden, Jersey Shore, Jackson Premium? Also from when the sale begins before thanksgiving?\\n\\nCan u also pls suggest which area in NYC can one get good cheaper stuff, as I presume Madison, 5th Avenue would be expensive?\\n",
                    "date": "20 Oct 2019, 4:03 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Sale Thanksgiving \\n",
                    "body": "\\n\\n\\n\\nThey do have sales and they will be packed with people\\n",
                    "date": "20 Oct 2019, 4:07 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12986985-Getting_from_Union_Square_to_Newark_Airport-New_York_City_New_York.html",
            "title": "\\nGetting from Union Square to Newark Airport ",
            "body": "\\n\\n\\n\\nI am traveling to (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103437114\\', \\'\\');}, \\'log_autolink_impression\\');NYC soon and will be flying out of Newark airport on my return trip. What is the best way (least transfers and economical) to get from Union Square -14th station to Newark airport? I am staying at Moxy NYC (112 East 11th street) and figured that I\\xe2\\x80\\x99d start by walking to Union Square. What recommendations can you make for getting to Newark airport, terminal C from Union Square? I am open to taking a cab or uber to another station, as well.\\n",
            "date": "18 Oct 2019, 3:03 AM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Getting from Union Square to Newark Airport \\n",
                    "body": "\\n\\n\\n\\nAll you do is take the uptown Q, N, W, or R train (your old friend) to 34th St, go out in to the street, walk from 6th Avenue to 7th Avenue, go down into (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103437438\\', \\'\\');}, \\'log_autolink_impression\\');Penn Station and take a New Jersey Transit Commuter Train (no relation to the subway, it's a separate regular railroad system) to the EWR (Newark Airport) Station. The ticket costs about $13.00 Then you use your ticket to get on the EWR Airtrain right to your terminal. \\n\\nAs easy as JFK, just that you have to walk one avenue (1/7 mile) in the street. And again, if lucky elevators all the way.\\n\\nhttps://www.njtransit.com/rg/rg_servlet.srv\\xe2\\x80\\xa6\\n\\nIf it's raining, do this: Take the same Uptown Q, N, R, or W to 42nd St, follow the red signs to the Downtown 1,2, or 3 train (all on the same same platform) take one of those one stop to 34th St, and you are under Penn Station right there. Then go to NJ Transit without exiting the building.\\n",
                    "date": "18 Oct 2019, 3:27 AM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Getting from Union Square to Newark Airport \\n",
                    "body": "\\n\\n\\n\\nYou have been so incredibly helpful! Thank you a million for sharing these details! I think I\\xe2\\x80\\x99ll be an expert at taking trains and subways by the time this trip is over! :-)\\n",
                    "date": "18 Oct 2019, 3:36 AM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Getting from Union Square to Newark Airport \\n",
                    "body": "\\n\\n\\n\\nNorth of DC is 100% right. I take this all the time. Great directions.\\n",
                    "date": "18 Oct 2019, 7:34 AM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Getting from Union Square to Newark Airport \\n",
                    "body": "\\n\\n\\n\\nmy way is different. As I explained in my post for your arrival, I\\xe2\\x80\\x99m okay with a little walking through the leafy loveliness of (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103446768\\', \\'\\');}, \\'log_autolink_impression\\');Greenwich Village side streets and prefer that over dragging luggage up and down stairs through crowded stations and trains.\\n\\n\\n\\nI walk over to the PATH station on 9th Street and 6th Avenue, take the PATH (more like a subway) to Journal Square, make the very easy transfer to another PATH line to Newak/Penn Station and then get on the train to the airport that others describe.\\n\\n\\n\\nIf you decide to take the subway up to Penn Station in NYC, be aware that station is giant with several separate railways.it can be hard to find your way around.\\n",
                    "date": "18 Oct 2019, 6:00 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Getting from Union Square to Newark Airport \\n",
                    "body": "\\n\\n\\n\\nYes, (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103448596\\', \\'\\');}, \\'log_autolink_impression\\');Penn Station is large, yes it is tedious to walk through it, but the signs are clear. You only need to follow one sign: \"NJ Transit --->\". That's as difficult as it gets. When you get to the main NJ/Amtrak Mezzanine, you look for then next NJ Transit train on the list leaving with the letters \"EWR\". That's the train you want.\\n\\nThe other way is certainly an good option; and it is a nice walk, but it's two somewhat slower trains, and you still have to get the NJ Transit train in Newark (much easier to change, however) But you only take the NJT train one stop to EWR. Speaking as a train lover, the PATH is one of my absolute favorites, and I've been all over N. America and Europe on many subway/light rail lines, So for variety, and a pleasant walk, do the PATH thing IF you want to.\\n\\nhttps:/\\xe2\\x80\\xa6maps-schedules.html\\n",
                    "date": "18 Oct 2019, 8:24 PM"
                }
            ]
        },
        {
            "continent": "America_Europe",
            "state": "New York",
            "link": "http://www.tripadvisor.in//ShowTopic-g60763-i5-k12989228-Itinerary_Help-New_York_City_New_York.html",
            "title": "\\nItinerary Help ",
            "body": "\\n\\n\\n\\nMy family and I are visiting (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103459843\\', \\'\\');}, \\'log_autolink_impression\\');NYC Nov 17th-20th. We are staying at the Luma hotel. \\n\\nI have put together some what of an itinerary, but since my dad will be traveling with a mobility scooter, I tried not to cram too much in, as I am not sure how easy he will be able to get around the city with it. Any help would be much appreciated. \\n\\n\\n\\nDay 1 Sunday Nov 17\\n\\nArrive to LGA at 11am (get to hotel around 1) \\n\\n3:30pm boat tour (90min)\\n\\ndinner\\n\\nMacy's \\n\\n\\n\\nDay 2 Monday Nov 18\\n\\n7:30am NBC studios / Today show\\n\\nSt Patrick's Cathedral\\n\\nTop of the Rock\\n\\nSaks Fifth Ave \\n\\nExplore Times Square \\n\\n\\n\\nDay 3 Tuesday Nov 19\\n\\nCentral Park (will spend at least half a day )\\n\\n\\n\\nDay 4 Wednesday Nov 20\\n\\n9/11 Memorial \\n\\nBrooklyn Bridge\\n\\nDepart 8pm\\n\\n\\n\\nShould I purchase TOTR tickets in advance? not sure what time it gets dark or best time for a view.\\n\\nI did not add any shows since no one in the party was interested.\\n\\nAlso plan on walking short distances and taking cabs on the longer trips.\\n",
            "date": "19 Oct 2019, 12:32 PM",
            "answers": [
                {
                    "title": "\\n1.\\n\\nRe: Itinerary Help \\n",
                    "body": "\\n\\n\\n\\nThis seems doable, but I hope you have Plan B for\\n\\n\\n\\nA) you may not be able to check in to your hotel until 3 or 4 unless you arrange an early check in, which might require a fee\\n\\n\\n\\nB) you have lots of outdoor time ( (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103460971\\', \\'\\');}, \\'log_autolink_impression\\');Central Park, Memorial, Brdge). What happens if it is cold or raining?\\n\\n\\n\\nYou can google sunset time for any date.\\nEdited: yesterday, 15:00 ",
                    "date": "19 Oct 2019, 2:59 PM"
                },
                {
                    "title": "\\n2.\\n\\nRe: Itinerary Help \\n",
                    "body": "\\n\\n\\n\\nI think you really need to spend some time thinking about some indoor activities, for Plan B's. It's already been pretty cold -- scarf, hat and glove weather for some people. \\n\\n\\n\\nIf I were you I would change the boat tour to to the next day. It's always not a great idea to plan something expensive and/or timed, on arrival day. Anything can go wrong. (ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103464208\\', \\'\\');}, \\'log_autolink_impression\\');Plane can be late/cancelled, luggage lost, room reservation messed up, etc.\\n\\n\\n\\nHalf a day in Central Park -- it's probably going to be too cold to do that. I would break it up with a visit to the Metropolitan Museum or the American Museum of Natural History, or the New York Historical Society.\\n",
                    "date": "19 Oct 2019, 8:25 PM"
                },
                {
                    "title": "\\n3.\\n\\nRe: Itinerary Help \\n",
                    "body": "\\n\\n\\n\\nSunset will be about 4:30 if I did my research correctly. Normally, we don't recommend buying any observatory ticket very far in advance as weather can adversely affect the view. However, sunset visits to observatories are very popular so you will want to monitor ticket availability to ensure tickets don't see out before you buy.\\n",
                    "date": "19 Oct 2019, 8:29 PM"
                },
                {
                    "title": "\\n4.\\n\\nRe: Itinerary Help \\n",
                    "body": "\\n\\n\\n\\nSunset: https://www.timeanddate.com/sun/usa/new-york\\xe2\\x80\\xa6\\n",
                    "date": "19 Oct 2019, 8:29 PM"
                },
                {
                    "title": "\\n5.\\n\\nRe: Itinerary Help \\n",
                    "body": "\\n\\n\\n\\nThank you guys for the help. I'm going to rearrange some things and start looking at some indoor activities.\\n\\nAre mobility scooters pretty easy to get around in times square?\\n",
                    "date": "20 Oct 2019, 8:10 AM"
                },
                {
                    "title": "\\n6.\\n\\nRe: Itinerary Help \\n",
                    "body": "\\n\\n\\n\\n(ta && ta.queueForLoad ? ta.queueForLoad : function(f, g){document.addEventListener(\\'DOMContentLoaded\\', f);})(function(){ta.trackEventOnPage(\\'postLinkInline\\', \\'impression\\', \\'postLinks-103471419\\', \\'\\');}, \\'log_autolink_impression\\');Times Square is very crowded and people-y. As with everywhere on the planet these days people walk and text or read their phones (something I personally find VERY aggravating). Sure, you can get around on a mobility scooter but I don't think it will be \"easy\" in places as crowded as Times Square.\\n",
                    "date": "20 Oct 2019, 8:32 AM"
                }
            ]
        }
    ]
}