[
    {
        "id": 299120,
        "name": "The Lalit New Delhi",
        "properties": [
            "Soundproof rooms",
            "Air conditioning",
            "Housekeeping",
            "Room service",
            "Safe",
            "Minibar",
            "Refrigerator",
            "Flatscreen TV",
            "Non-smoking rooms",
            "Suites",
            "Family rooms",
            "Smoking rooms available",
            "Free parking",
            "Free High Speed Internet (WiFi)",
            "Pool",
            "Fitness Centre with Gym / Workout Room",
            "Bar / lounge",
            "Nightclub / DJ",
            "Babysitting",
            "Children Activities (Kid / Family Friendly)",
            "VIP room facilities",
            "Valet parking",
            "Wifi",
            "Outdoor pool",
            "Fitness / spa changing rooms",
            "Sauna",
            "Restaurant",
            "Breakfast available",
            "Breakfast buffet",
            "Poolside bar",
            "Airport transportation",
            "Car hire",
            "Taxi service",
            "Business Centre with Internet Access",
            "Conference facilities",
            "Banquet room",
            "Meeting rooms",
            "Fax / photocopying",
            "Spa",
            "Salon",
            "Rooftop terrace",
            "24-hour security",
            "Baggage storage",
            "Concierge",
            "Currency exchange",
            "Gift shop",
            "Newspaper",
            "Non-smoking hotel",
            "Shops",
            "Butler service",
            "Doorperson",
            "24-hour front desk",
            "Dry cleaning",
            "Laundry service",
            "Ironing service",
            "Shoeshine",
            "Hindi"
        ],
        "description": "The LaLiT Hotels in Delhi, one of the best luxury hotels in Delhi India, stands tall right in the middle of city’s premier business and commercial district – Connaught Place. Being the central luxury business hotel in Delhi, it is located right next to lively shopping centres, office complexes and colourful streets, the hotel is 24 kms from the international airport and just minutes away from government offices, cultural centres and international trade fairgrounds. With the largest room sizes amongst all luxury hotels Delhi, The LaLiT New Delhi offers a total of 461 five star hotel rooms. The bedrooms are all well tailored to the needs of both a business traveler as well as a vacationer and accompanied by hotels modern amenities and elegant decor. Guests at our luxury hotels, have an option of choosing from a Deluxe Rooms, LaLiT Luxury Rooms and the suites. Serving cuisines from both the world of east and west, The LaLiT, hotels New Delhi offers four fine dining restaurants serving food to suit all types of palate. For those enjoying traditional Oriental food, The Woks serve authentic Oriental food while The Grill serves European food. And if guests want to taste food prepared in the traditional Indian way, we invite them to try our Indian cuisine at Baluchi while our multi-cuisine restaurant and Bar – 24/7 is the best place for guests who enjoy food while also interacting with chefs of the restaurant. At 24/7 guests have an option of choosing variety of food at the buffet or being selective through the elaborate a-la-carte menu. At The LaLiT, luxury hotel Delhi, guests can be at comfort both at work as well as leisure. Ideal for all types of events, The LaLiT New Delhi offers a total of six banquet hall. Guests can organize all types of events with us - from small top-notch corporate events to private party events and from big conference meeting to huge wedding ceremony. Enough to accommodate upto 800 people, hotels' banquet facilities are added advantage amongst all hotels in Delhi. So whether the event is corporate or if it is a planning a wedding at hotels, The LaLiT New Delhi hotels offers just the right kind of banquets and meeting space for the hotels in New Delhi. Other world class hotel facilities at this 5 star luxury hotels Delhi include 24 hour Business Centre, Hotels Concierge Desk, Foreign Exchange, Limousine Service, 24 hour In-room Dining, Laundry Service, Valet Car Parking, Shopping Arcade, Doctor on Call, Rejuve – The Spa and a well equipped Gymnasium so that the business traveler feels more productive and rejuvenated. At Connaught Place, the center of the city - is The LaLiT New Delhi - an 18 story edifice with easy access to the city’s commercial complexes, conference centers, shopping hubs and historic sights. Wonderful interiors, immaculate service and fine cuisine combine to make The LaiLiT New Delhi is an eventful address of the city. Amongst other five star hotels Delhi this luxury hotel is within close proximity to historical landmarks like India Gate, Jama Masjid and Red Fort. Located at the city center, The Lalit New Delhi is just 35 minute drive from the airport and is merely 5 minute from the railway station. The city is well connected through air and rail links apart from two of the national highways which connect New Delhi to all the major cities in the country. The Hotel is also 10 minute drive from the trade fair ground and merely 15 minute drive from several embassies.",
        "address": "Barakhamba Avenue Connaught Place, New Delhi 110001 India",
        "latitude": 28.631432,
        "longitude": 77.22716,
        "rating": 4.5,
        "ranking": "11 of 1264",
        "url": "https://www.tripadvisor.in/Hotel_Review-g304551-d299120-Reviews-The_Lalit_New_Delhi-New_Delhi_National_Capital_Territory_of_Delhi.html",
        "reviews": [
            {
                "id": 752534401,
                "name": "Great Hotel",
                "description": "The facilities were great. I loved how there were speakers in the washroom. Staff were friendly. Room was spacious. The bed and pillows were comfy . All in all it was a great experience to stay in this hotel and I would definitely recommend others to stay here.",
                "rating": 5.0,
                "url": "https://www.tripadvisor.in/ShowUserReviews-g304551-d299120-r752534401-The_Lalit_New_Delhi-New_Delhi_National_Capital_Territory_of_Delhi.html"
            },
            {
                "id": 743634007,
                "name": "Outstanding hotel in New Delhi",
                "description": "Outstanding hotel. Well located in the center close to attractions and shopping center. Large room , well equipped with all our needs. Very clean. Breakfast was rich with all kind of food (local, international...). Great smiling staff always waiting to help in any way. We had celebration during our stay and they decorated our room with white swans (towels folded) and a great cack.",
                "rating": 5.0,
                "url": "https://www.tripadvisor.in/ShowUserReviews-g304551-d299120-r743634007-The_Lalit_New_Delhi-New_Delhi_National_Capital_Territory_of_Delhi.html"
            },
            {
                "id": 752173510,
                "name": "Good Stay",
                "description": "Big lobby, good location. Rooms were clean and big, bed was comfortable. Views from room not that great. Breakfast was good. One downside of the hotel is no outside food is allowed, so you can't buy your McD and eat in.",
                "rating": 5.0,
                "url": "https://www.tripadvisor.in/ShowUserReviews-g304551-d299120-r752173510-The_Lalit_New_Delhi-New_Delhi_National_Capital_Territory_of_Delhi.html"
            },
            {
                "id": 752129848,
                "name": "It's all about ...The staff for us.",
                "description": "The hotel Lalit is a lovely hotel with lots of amenities, location is perfect for anyone visiting New Delhi. But for us the staff are what makes this hotel, we stayed 9 nights and through the virus outbreak the staff kept us together. I can not thank them enough for looking after me and my wife, We shall always be grateful.",
                "rating": 5.0,
                "url": "https://www.tripadvisor.in/ShowUserReviews-g304551-d299120-r752129848-The_Lalit_New_Delhi-New_Delhi_National_Capital_Territory_of_Delhi.html"
            },
            {
                "id": 751994834,
                "name": "The worst hotel and customer service",
                "description": "I stayed for 12 nights, had to room move because off mold and odor. Not surprisingly, another guest had issues as the guest was in the elevator with the manager and the guest was very upset. We heard everything. My flight was delayed because of the virus situation, so I went on the internet as the front desk won’t honor the internet prices. They were charging an arm an a leg to extend for 1 more night. Almost triple the cost even though the hotel was slow, they were already closing floors. So I went online, my first attempt said my session was expired abs bump me back to book. So I did not knowing the first reservation was booked. Upon checking out and checking in, the agent at the desk said there were 2 reservation. I explained what happened she said ok they will cancel one off the reservation. Not true, they charged fir both reservation and also wanted to charge me for car services I never used or authorized. Then there were an event which I booked with my credit card and the money was taken. Then they made me pay cash, it took me a few days to get the money back. Be careful with your bill as they put charges that’s not yours. The service is just awful and at times feel like robbery.",
                "rating": 1.0,
                "url": "https://www.tripadvisor.in/ShowUserReviews-g304551-d299120-r751994834-The_Lalit_New_Delhi-New_Delhi_National_Capital_Territory_of_Delhi.html"
            }
        ]
    }
]